/*---------------------------------------------------------*
 * Copyright (C) 2018 杭州优恩捷科技有限公司。版权所有。
 *
 * 文件名：AppCommunication.h
 * 文件功能描述：APP负责通信模块
 *
 * 修改记录：
 * 2022-07-23 戴辉发 创建
 *----------------------------------------------------------*/

#ifndef APP_COMMUNICATION_DEFINE
#define APP_COMMUNICATION_DEFINE

#include <stdint.h>


/*==============================================================
 * 函数名称：AppCommonMemInit
 * 函数功能：APP模块内存初始化
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *           无
 * 修改记录：
 *===============================================================
 * 日期                修改人             修改内容
 * 2022-07-17          戴辉发             创建
 ==============================================================*/
void AppCommonMemInit(void);
/*==============================================================
 * 函数名称：AppCommonTimer
 * 函数功能：APP模块定时器，100毫秒定时器
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *           无
 * 修改记录：
 *===============================================================
 * 日期                修改人             修改内容
 * 2022-07-18          戴辉发             创建
 ==============================================================*/
void AppCommonTimer(void);
/*==============================================================
 * 函数名称：AppCommonProcess
 * 函数功能：APP模块处理流程
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *           无
 * 修改记录：
 *===============================================================
 * 日期                修改人             修改内容
 * 2022-07-18          戴辉发             创建
 ==============================================================*/
void AppCommonProcess(void);
#endif
