/*---------------------------------------------------------*
 * Copyright (C) 2018 杭州优恩捷科技有限公司。版权所有。
 *
 * 文件名：AppCurrManage.h
 * 文件功能描述：应对通信的电流管理模块
 *
 * 修改记录：
 * 2022-07-15 戴辉发 创建
 *----------------------------------------------------------*/

#ifndef _APP_CURR_MANAGE_DEFINE_
#define _APP_CURR_MANAGE_DEFINE_

#include <stdint.h>
/*=============================================================
 * 函数名称：feedback_mem_init
 * 函数功能：电流管理模块内存初始化
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *           无
 * 修改记录：
 *==============================================================
 * 日期                修改人             修改内容
 * 2018-06-27          戴辉发             创建
==============================================================*/
void Alarm_current_mem_init(void);

/*==============================================================
 * 函数名称：TempDifferentTimer
 * 函数功能：APP通信模块定时器，以10毫秒为单位
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *           无
 * 修改记录：
 *===============================================================
 * 日期                修改人             修改内容
 * 2022-07-22          戴辉发             创建
 ==============================================================*/
void CurrentStateTimer(void);
/*=============================================================
* 函数名称：CurrentAlarmJudge
* 函数功能：电流告警判决
* 函数参数：
* 返回值：  
*           无
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2024-03-19         liyong             创建
==============================================================*/
void CurrentAlarmJudge(void);
/*=============================================================
* 函数名称：GetFeedbackAlarmReport
* 函数功能：获取反馈电流告警状态
* 函数参数：
* 返回值：  
*           电芯温度温差状态
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2024-03-19         liyong             创建
==============================================================*/
 uint8_t GetFeedbackAlarmReport();
/*=============================================================
* 函数名称：GetChargeCurrentOverReport
* 函数功能：获取充电过流状态
* 函数参数：
* 返回值：  
*           充电过流状态
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2024-03-19         liyong             创建
==============================================================*/
uint8_t GetChargeCurrentOverReport(void);

/*=============================================================
* 函数名称：GetTransientDisCurrentOverReport
* 函数功能：获取瞬态放电过流状态
* 函数参数：
* 返回值：  
*           瞬态放电过流状态
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2024-03-19         liyong             创建
==============================================================*/
uint8_t GetTransientDisCurrentOverReport(void);
/*=============================================================
* 函数名称：GetContinuousDisCurrentOverReport
* 函数功能：获取持续放电过流状态
* 函数参数：
* 返回值：  
*           瞬态放电过流状态
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2024-03-19         liyong             创建
==============================================================*/
uint8_t GetContinuousDisCurrentOverReport(void);
#endif