/*---------------------------------------------------------*
 * Copyright (C) 2018 杭州优恩捷科技有限公司。版权所有。
 *
 * 文件名：AppTempManage.h
 * 文件功能描述：应对通信的温度管理模块
 *
 * 修改记录：
 * 2022-07-15 戴辉发 创建
 *----------------------------------------------------------*/

#ifndef _APP_TEMP_MANAGE_DEFINE_
#define _APP_TEMP_MANAGE_DEFINE_
/*==============================================================
 * 函数名称：TempDifferentTimer
 * 函数功能：APP通信模块定时器，以10毫秒为单位
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *           无
 * 修改记录：
 *===============================================================
 * 日期                修改人             修改内容
 * 2022-07-22          戴辉发             创建
 ==============================================================*/
void TempDifferentTimer(void);
/*==============================================================
 * 函数名称：AppCommunicationMemInit
 * 函数功能：APP通信模块内存初始化
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *           无
 * 修改记录：
 *===============================================================
 * 日期                修改人             修改内容
 * 2022-07-17          戴辉发             创建
 ==============================================================*/
void TempDifferentMemInit(void);
/*==============================================================
 * 函数名称：TempDifferentProcess
 * 函数功能：电芯温度温差3级告警分析
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *           无
 * 修改记录：
 *===============================================================
 * 日期                修改人             修改内容
 * 2022-07-18          戴辉发             创建
 ==============================================================*/
void TempDifferentProcess(void);
/*=============================================================
* 函数名称：GetDischTempFirstReport
* 函数功能：获取单体电芯状态
* 函数参数：
* 返回值：  
*           电芯电压状态
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2024-03-19         liyong             创建
==============================================================*/
uint8_t GetTempFirstReport();
/*=============================================================
* 函数名称：GetCellTempDifferentReport
* 函数功能：获取电芯温度温差状态
* 函数参数：
* 返回值：  
*           电芯温度温差状态
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2024-03-19         liyong             创建
==============================================================*/
 uint8_t GetCellTempDifferentReport();
 /*=============================================================
* 函数名称：GetDischTempFirstReport
* 函数功能：获取单体电芯状态
* 函数参数：
* 返回值：  
*           电芯电压状态
* 修改记录:
*==============================================================
* 日期                修改人             修改内容
* 2024-03-19         liyong             创建
==============================================================*/
uint8_t GetCellTempFirstReport();
/*=============================================================
* 函数名称：GetDischTempFirstReport
* 函数功能：获取单体电芯状态
* 函数参数：
* 返回值：  
*           电芯电压状态
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2024-03-19         liyong             创建
==============================================================*/
uint8_t GetPowerTempFirstReport();
/*=============================================================
* 函数名称：GetDischTempFirstReport
* 函数功能：获取单体电芯状态
* 函数参数：
* 返回值：  
*           电芯电压状态
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2024-03-19         liyong             创建
==============================================================*/
uint8_t GetenvirTempFirstReport();

#endif