/*---------------------------------------------------------*
 * Copyright (C) 2018 杭州优恩捷科技有限公司。版权所有。
 *
 * 文件名：AppVolManage.h
 * 文件功能描述：应对通信的电压管理模块
 *
 * 修改记录：
 * 2022-07-15 戴辉发 创建
 *----------------------------------------------------------*/

#ifndef _APP_VOL_MANAGE_DEFINE_
#define _APP_VOL_MANAGE_DEFINE_

#include <stdint.h>
/*=============================================================
 * 函数名称：APPVoltageTimerDelay
 * 函数功能：电压处理100ms延时
 * 参数个数：0
 * 参数描述：
 * 
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期          修改人      修改类型
* 2024-03-19         liyong             创建
==============================================================*/
void APPVoltageTimerDelay(void);
/*=============================================================
 * 函数名称：VoltageMemoryWake_mem_init
 * 函数功能：电流管理模块内存初始化
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *           无
 * 修改记录：
 *==============================================================
 * 日期                修改人             修改内容
 * 2018-06-27          戴辉发             创建
==============================================================*/
void VoltageMemoryWake_mem_init(void);

/*=============================================================
* 函数名称：VoltageAlarmJudge
* 函数功能：电压告警判决
* 函数参数：
* 返回值：  
*           无
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2024-03-19         liyong             创建
==============================================================*/
void VoltageAlarmJudge(void);

/*=============================================================
* 函数名称：GetcellVoltageFirstReport
* 函数功能：获取单体电芯状态
* 函数参数：
* 返回值：  
*           电芯电压状态
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2024-03-19         liyong             创建
==============================================================*/
uint8_t GetcellVoltageFirstReport();
/*=============================================================
* 函数名称：GetcellVoltageFirstReport
* 函数功能：获取单体电芯状态
* 函数参数：
* 返回值：  
*           电芯电压状态
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2024-03-19         liyong             创建
==============================================================*/
uint8_t GettatolVoltageFirstReport();
/*=============================================================
* 函数名称：GetVoltageDifferentReport
* 函数功能：获取单体电芯状态
* 函数参数：
* 返回值：  
*           电芯电压状态
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2024-03-19         liyong             创建
==============================================================*/
uint8_t GetVoltageDifferentReport();
#endif
