/*---------------------------------------------------------*
 * Copyright (C) 2018 杭州优恩捷科技有限公司。版权所有。
 *
 * 文件名：AFE_APP.H
 * 文件功能描述：实现AFE上层封装
 * 
 * 修改记录：
 * 2021-05-06    戴辉发    创建
*----------------------------------------------------------*/

#ifndef _AFE_APP_DEFINE_
#define _AFE_APP_DEFINE_

#include "stdint.h"

#if defined( BATTARY_LFP )
#define AFE_OVP_CELL_VOL         (3900)
#if defined(TIANFENG)
#define AFE_UVP_CELL_VOL         (1800)
#else
#define AFE_UVP_CELL_VOL         (2000)
#endif

#else
#define AFE_OVP_CELL_VOL         (4300)
#define AFE_UVP_CELL_VOL         (2500)
#endif

/* AFE芯片的电芯温感对应的是电压点的比较，而温度越高，对应的NTC阻值就越小，
   按AFE推荐的接法，温感采样点的电压就越高，因此AFE的要求是过温触发点为，采样点
   电压超过AFE中设定的电压采样点，而实际电路中，NTC接法与AFE推荐的刚好相反，因此
   在设置过温时，实际设置的是欠温点，设置AFE的欠温点实际是系统的过温点
   设置AFE的过温点为70℃，欠温点为-25℃
   计算公式，RTC(总) = (Rtc * 2000000) / (Rtc + 2000000)
   Vrtc = (AFE3V3 * RTC(总)) / (RTC(总) + 100000(10k))
   AFE设置值 = Vrtc * 16384 / 64 / 5
 */

/* -25.0℃ */
#define AFE_OVT_CELL_TEMP        (151)
/* 60.0℃ */
#define AFE_UVT_CELL_TEMP        (39)


#define AFE_SHORT_CURRENT        (-800)
#if defined(CAPCITY_100)
#define AFE_OVER_DCH_CURRENT     (300)
#define AFE_OVER_CH_CURRENT      (300)
#else
#define AFE_OVER_DCH_CURRENT     (230)
#define AFE_OVER_CH_CURRENT      (230)
#endif

typedef enum _E_SWITCH_STATUS_
{
	E_ALL_OFF, /* 充放电开关断开 */
    E_ALL_ON,  /* 充放电开关闭合 */
	E_DISCHARGE_ON, /* 放电开关闭合 */
	E_DISCHARGE_OFF, /* 放电开关断开 */
	E_CHARGE_ON, /* 充电开关闭合 */
	E_CHARGE_OFF, /* 充电开关断开 */
	//E_DCHON_CHOFF, /* 放电开关闭合，充电开关断开 */
	//E_DCHOFF_CHON, /* 放电开关断开，充电开关闭合 */
	//E_DCHON_CHON, /* 放电开关闭合，充电开关闭合 */
}e_switch_status;

/*=============================================================
 * 函数名称：afe_app_mem_init
 * 函数功能：AFE应用内存初始化
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 *           无
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-05-03        戴辉发      创建
==============================================================*/
void afe_app_mem_init(void);

/*=============================================================
 * 函数名称：set_vol_buf
 * 函数功能：设定上层处理电压缓冲地址
 * 参数个数：2
 * 参数描述：
 *          [IN]     buf        缓冲地址
 *          [IN]     cell_num   电芯个数
 * 返 回 值：
 *          无
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-06-03        戴辉发      创建
==============================================================*/
void set_vol_buf(uint32_t addr);

/*=============================================================
 * 函数名称：set_temp_buf
 * 函数功能：设定上层处理电芯温度缓冲地址
 * 参数个数：1
 * 参数描述：
 *          [IN]     addr        温度处理函数地址
 *                               函数型式void temp_deal_proc(uint16_t temp_rvalue, uint8_t index)
 * 返 回 值：
 *           无
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-06-03        戴辉发      创建
==============================================================*/
void set_temp_buf(uint32_t addr);

/*=============================================================
 * 函数名称：set_curr_deal_process
 * 函数功能：设定电流处理函数地址
 * 参数个数：1
 * 参数描述：
 *          [IN]     addr        电流处理函数地址
 *                               函数型式void curr_deal_proc(uint16_t cell_vol)
 * 返 回 值：
 *           无
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-05-10        戴辉发      创建
==============================================================*/
void set_curr_deal_process(uint32_t addr);

/*=============================================================
 * 函数名称：afe_app_timer
 * 函数功能：AFE应用定时器
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 *           无
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-05-10        戴辉发      创建
==============================================================*/
void afe_app_timer(void);

/*=============================================================
 * 函数名称：afe_app_init
 * 函数功能：AFE应用初始化
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 *           无
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-05-03        戴辉发      创建
==============================================================*/
void afe_app_init(void);

/*=============================================================
 * 函数名称：afe_app_sleep
 * 函数功能：AFE应用进入休眠状态
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 *           无
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-05-06        戴辉发      创建
==============================================================*/
uint8_t afe_app_sleep(void);

/*=============================================================
 * 函数名称：get_adjust_cell_vol
 * 函数功能：获取校准时单体电压
 * 参数个数：1
 * 参数描述：
 *           [IN/OUT]cell_buf    获取到的电芯电压
 * 返 回 值：
 *           0       获取失败
 *           1       获取成功
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-11-02        戴辉发      创建
==============================================================*/
uint8_t get_adjust_cell_vol(uint16_t *cell_buf);

/*=============================================================
 * 函数名称：get_curr_vol_data
 * 函数功能：获取电流采样分流器两端的电压
 * 参数个数：1
 * 参数描述：
 *           [IN/OUT] *curr_vol  分流器两端的电压
 * 返 回 值：
 *           0       获取失败
 *           1       获取成功
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-10-25        戴辉发      创建
==============================================================*/
uint8_t get_curr_vol_data(uint16_t *curr_vol);

/*=============================================================
 * 函数名称：get_data_process
 * 函数功能：获取数据流程
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 *           无
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-05-06        戴辉发      创建
==============================================================*/
void get_data_process(void);

/*=============================================================
 * 函数名称：get_cell_vol_ovp_status
 * 函数功能：获取AFE检测到的过压保护标志
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 *           0       没有过压
 *           1       发生过压
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-05-08        戴辉发      创建
==============================================================*/
uint8_t get_cell_vol_ovp_status(void);

/*=============================================================
 * 函数名称：get_cell_vol_uvp_status
 * 函数功能：获取AFE检测到的欠压保护标志
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 *           0       没有欠压
 *           1       发生欠压
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-05-08        戴辉发      创建
==============================================================*/
uint8_t get_cell_vol_uvp_status(void);

/*=============================================================
 * 函数名称：get_curr_status
 * 函数功能：获取AFE检测到的过流保护标志
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 *           0       没有电流保护
 *           1       发生充电电流保护
 *           2       放电过流保护
 *           3       短路保护
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-05-08        戴辉发      创建
==============================================================*/
uint8_t get_curr_status(void);

/*=============================================================
 * 函数名称：get_load_status
 * 函数功能：获取AFE检测到的负载状态
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 *           0       负载接入
 *           1       负载移除
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-05-08        戴辉发      创建
==============================================================*/
uint8_t get_load_status(void);

/*=============================================================
 * 函数名称：get_ch_remove_status
 * 函数功能：获取AFE检测到的充电器移除状态
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 *           0       充电器接入
 *           1       充电器移除
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-05-08        戴辉发      创建
==============================================================*/
uint8_t get_ch_remove_status(void);

/*=============================================================
 * 函数名称：get_ch_switch_status
 * 函数功能：获取充电MOS状态
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 *           0       充电MOS断开
 *           1       充电MOS闭合
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-05-08        戴辉发      创建
==============================================================*/
uint8_t get_ch_switch_status(void);

/*=============================================================
 * 函数名称：get_dch_switch_status
 * 函数功能：获取放电MOS状态
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 *           0       放电MOS断开
 *           1       放电MOS闭合
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-05-08        戴辉发      创建
==============================================================*/
uint8_t get_dch_switch_status(void);

/*=============================================================
 * 函数名称：get_cell_open_status
 * 函数功能：获取AFE检测到的电芯断线检测状态
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 *           0       正常
 *           >0      电芯断线
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-05-08        戴辉发      创建
==============================================================*/
uint8_t get_cell_open_status(void);

/*=============================================================
 * 函数名称：get_cell_temp_status
 * 函数功能：获取AFE检测到的电芯温度保护状态
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 *           0       电芯温度正常
 *           1       电芯高温保护
 *           2       电芯低温保护
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-05-08        戴辉发      创建
==============================================================*/
uint8_t get_cell_temp_status(void);

/*=============================================================
 * 函数名称：cell_balance_off
 * 函数功能：关闭指定电芯均衡
 * 参数个数：1
 * 参数描述：
 *           [IN]    index        索引
 * 返 回 值：
 *           无
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-05-08        戴辉发      创建
==============================================================*/
void cell_balance_off(uint8_t index);

/*=============================================================
 * 函数名称：cell_balance_on
 * 函数功能：打开指定电芯均衡
 * 参数个数：1
 * 参数描述：
 *           [IN]    index        索引
 * 返 回 值：
 *           无
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-05-08        戴辉发      创建
==============================================================*/
void cell_balance_on(uint8_t index);


/*=============================================================
 * 函数名称：afe_control_off_dis
 * 函数功能：AFE导致的控制
 * 参数个数：0
 * 参数描述：
 *           
 * 返 回 值：
 *           0       不存在AFE自动切断MOS操作
 *           1       存在AFE保护自动切断MOS操作
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-05-08        戴辉发      创建
==============================================================*/
uint8_t afe_control_off_dis(void);

/*=============================================================
 * 函数名称：afe_control_off_chg
 * 函数功能：AFE导致的充电MOS控制
 * 参数个数：0
 * 参数描述：
 *           
 * 返 回 值：
 *           0       不存在AFE自动切断MOS操作
 *           1       存在AFE保护自动切断MOS操作
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-05-11        戴辉发      创建
==============================================================*/
uint8_t afe_control_off_chg(void);

/*=============================================================
 * 函数名称：get_afe_status
 * 函数功能：获取AFE状态
 * 参数个数：0
 * 参数描述：
 *           
 * 返 回 值：
 *           0       正常通信状态
 *           1       自检或通信失败状态
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-05-11        戴辉发      创建
==============================================================*/
uint8_t get_afe_status(void);

     /*=============================================================
 * 函数名称：afe_final_protect
 * 函数功能：AFE终极保护处理流程
 * 参数个数：0
 * 参数描述：
 *           
 * 返 回 值：
 *           无
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-05-11        戴辉发      创建
==============================================================*/
void afe_final_protect(void);
/*=============================================================
 * 函数名称：afe_final_protect_clear
 * 函数功能：AFE终极保护清零
 * 参数个数：0
 * 参数描述：
 *           
 * 返 回 值：
 *           无
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-07-22         liy      创建
==============================================================*/
void afe_final_protect_clear(void);
/*=============================================================
 * 函数名称：get_afe_dis_mos_status
 * 函数功能：实时获取afe放电mos状态
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
           0x0  断开
           0x1  闭合
           0x2  无效状态
 *           无
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-05-06        戴辉发      创建
==============================================================*/
uint8_t get_afe_dis_mos_status(void);
/*=============================================================
 * 函数名称：get_afe_control_chg_mos_status
 * 函数功能：实时获取afe充电mos状态
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
           0x0  断开
           0x1  闭合
           0x2  无效状态
 *           无
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-05-06        戴辉发      创建
==============================================================*/
uint8_t get_afe_chg_mos_status(void);

/*******************************************************************************
**FuncName: get_cell_voltage_measure;//
**Function: 电压采集前，关闭均衡20ms;
**Output  :  0：不需要关闭 1：需要关闭;
**input   : 无;
**Create date : liyong @2021.8.24
**Modify  : 
*******************************************************************************/
uint8_t get_cell_voltage_measure(void);

/*=============================================================
 * 函数名称：close_load_detect_proc
 * 函数功能：关闭load检测
 * 参数个数：0
 * 参数描述：
 *           
 * 返 回 值：
 *           无
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-08-22        li     创建
==============================================================*/
void close_load_detect_proc();
/*=============================================================
 * 函数名称：ch_disch_mos_ctrl
 * 函数功能：MOS控制
 * 参数个数：1
 * 参数描述：
 *           [IN]    swt_status   索引
 * 返 回 值：
 *           0: 控制不成功
             1：控制成功
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-05-08        戴辉发      创建
==============================================================*/
uint8_t ch_disch_mos_ctrl(e_switch_status swt_status);
extern uint32_t seeBackupVoltageFlag;
#endif
