#ifndef _BALANCE_DEFINE_
#define _BALANCE_DEFINE_

#include "stdint.h"

/* 均衡状态 */
typedef enum _E_BALANCE_STATUS_ {
    E_BALANCE_IDLE, /* 无均衡 */
    E_BALANCE_ON, /* 均衡开启 */
}e_balance_status;

/* 电芯状态 */
typedef enum _BATTARY_STATUS_
{
    E_BAT_COMMON, /* 电芯正常 */ 
    E_BAT_FAIL_WAIT, /* 电芯失效等待 */
    E_BAT_FAIL /* 电芯失效 */
}e_battary_status;

/*=============================================================
* 函数名称：balance_mem_init
* 函数功能：均衡模块内存初始化
* 参数个数：
* 函数参数：
* 返 回 值：
*           无
* 修改记录:
*===============================================================
* 日期             修改人     修改内容
* 2018-06-23       戴辉发     创建
==============================================================*/
void balance_mem_init(void);

/*=============================================================
* 函数名称：judge_balance_status
* 函数功能：判决均衡状态
* 参数个数：
* 函数参数：
* 返 回 值：
*           1      处于均衡状态
*           0      不处于均衡状态
* 修改记录:
*===============================================================
* 日期             修改人     修改内容
* 2018-06-23       戴辉发     创建
==============================================================*/
uint8_t judge_balance_status(void);

/*=============================================================
* 函数名称：get_bat_status
* 函数功能：获取电芯状态
* 参数个数：
* 函数参数：
* 返 回 值：
*           当前电芯状态
* 修改记录:
*===============================================================
* 日期             修改人     修改内容
* 2018-06-23       戴辉发     创建
==============================================================*/
e_battary_status get_bat_status(void);

/*==============================================================
* 函数名称：b_timer_ms_run
* 函数功能：均衡模块定时器，本定时器只在采样芯片为5238时有效
* 参数个数：
* 函数参数：
* 返 回 值：
*           无
* 修改记录:
*===============================================================
* 日期             修改人     修改内容
* 2018-06-23       戴辉发     创建
==============================================================*/
void b_timer_ms_run(void);

/*=============================================================
* 函数名称：balance_close
* 函数功能：关闭均衡
* 参数个数：
* 函数参数：
* 返 回 值：
*           无
* 修改记录:
*===============================================================
* 日期             修改人     修改内容
* 2019-08-09       戴辉发     创建
==============================================================*/
void balance_close(void);

/*=============================================================
* 函数名称：balance_start
* 函数功能：启动均衡模块
* 参数个数：
* 函数参数：
* 返 回 值：
*           无
* 修改记录:
*===============================================================
* 日期             修改人     修改内容
* 2019-08-09       戴辉发     创建
==============================================================*/
void balance_start(void);

/*==============================================================
* 函数名称：balance_mange
* 函数功能：均衡模块管理流程
* 参数个数：
* 函数参数：
* 返 回 值：
*           无
* 修改记录:
*===============================================================
* 日期             修改人     修改内容
* 2018-06-23       戴辉发     创建
==============================================================*/
void balance_mange(void);
/*=============================================================
 * 函数名称：balance_record_hard_init
 * 函数功能：均衡模块计数值初始化
 * 参数个数：0
 * 参数描述：
 *
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期                     修改人         修改类型
 * 2020-06-03        liyong       创建
==============================================================*/
void balance_record_hard_init(void);

/*=============================================================
 * 函数名称：reset_blance_num
 * 函数功能：恢复均衡次数
 * 参数个数：0
 * 参数描述：
 *
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期                     修改人         修改类型
 * 2020-10-13                  liyong         创建
==============================================================*/
void reset_blance_num(void);

/*=============================================================
 * 函数名称：balance_no_mem_init
 * 函数功能：均衡模块计数值初始化
 * 参数个数：
 * 函数参数：
 * 返 回 值：
 *           无
 * 修改记录:
 *==============================================================
 * 日期             修改人     修改内容
 * 2018-06-23       戴辉发     创建
==============================================================*/
void balance_no_mem_init(void);
/*=============================================================
 * 函数名称：recordbalance_data
 * 函数功能：保存均衡记录
 * 参数个数：0
 * 参数描述：
 *
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期                     修改人         修改类型
 * 2020-06-03                  liyong         创建
==============================================================*/
void recordbalance_data(void);

extern uint8_t g_balance_index;
#endif
