/*
 * show.h
 *
 *  Created on: 2018年9月26日
 *      Author: daihuifa
 */
#ifndef BLUETOOTH_H_
#define BLUETOOTH_H_

#include "stdint.h"
extern uint8_t g_send_over_flag;
/*==============================================================
* 函数名称：oled_hard_init
* 函数功能：显示屏硬件初始化
* 参数个数：0
* 函数参数：
* 返 回 值：
*           无
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2019-09-17          戴辉发             创建
==============================================================*/
void oled_hard_init(void);

/*==============================================================
* 函数名称：oled_power_on
* 函数功能：显示屏模块电源上电
* 参数个数：0
* 函数参数：
* 返 回 值：
*           无
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2019-09-17          戴辉发             创建
==============================================================*/
void oled_power_on(void);

/*==============================================================
* 函数名称：oled_power_on
* 函数功能：显示屏模块电源下电
* 参数个数：0
* 函数参数：
* 返 回 值：
*           无
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2019-09-17          戴辉发             创建
==============================================================*/
void oled_power_off(void);

/*==============================================================
* 函数名称：BluetoothHardwareInit
* 函数功能：蓝牙模块硬件初始化
* 参数个数：0
* 函数参数：
* 返 回 值：
*           无
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2018-09-26          liyong             创建
==============================================================*/
void BluetoothHardwareInit(void);

/*==============================================================
* 函数名称：show_hard_low_init
* 函数功能：显示屏模块硬件初始化
* 参数个数：0
* 函数参数：
* 返 回 值：
*           无
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2018-09-26          戴辉发             创建
==============================================================*/
void show_hard_low_init(void);

/*==============================================================
* 函数名称： blueRecvData_from_dmam_dma
* 函数功能：蓝牙模块串口接收
* 参数个数：1
* 函数参数：
*          [IN]         data               接收到的串口数据
* 返 回 值：
*          无
* 修改记录:
*===============================================================
* 日期                  修改人             修改内容
* 2018-09-26            戴辉发             创建
==============================================================*/
void blueRecvData_from_dma(uint8_t data);

/*==============================================================
* 函数名称：show_recv_data_deal
* 函数功能：显示数据处理流程
* 参数个数：0
* 函数参数：
* 返 回 值：
*           无
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2018-09-26          戴辉发             创建
==============================================================*/
void show_recv_data_deal(void);

/*==============================================================
* 函数肂luetoothDataProcessocess
* 函数功能：显示接收数据处理流程
* 参数个数：0
* 函数参数：
* 返 回 值：
*           无
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2019-09-17          戴辉发             创建
==============================================================*/
void BluetoothDataProcess(void);
/*=============================================================
 *  函数名称：set_buttonkey_flag
 * 函数功能：OLED开关检测唤醒标志设置
 * 参数个数：1
 * 参数描述：
 * 返 回 值：
 *           
 * 修改记录：
 *===============================================================
 * 日    期          修改人      修改类型
 * 2021-02-21         李勇    	创建
==============================================================*/
void set_buttonkey_flag(uint8_t flag);
/*=============================================================
 *  函数名称：get_buttonkey_wake_flag
 * 函数功能：获取OLED开关检测唤醒标志
 * 参数个数：
 * 参数描述：
 * 返 回 值：1
 *           
 * 修改记录：
 *===============================================================
 * 日    期          修改人      修改类型
 * 2021-02-21         李勇    	创建
==============================================================*/
uint8_t get_buttonkey_wake_flag(void);
/*=============================================================
 *  函数名称：get_buttonkey_gpio_status
 * 函数功能：获取OLED开关检测管脚状态
 * 参数个数：
 * 参数描述：
 * 返 回 值：1
 *           
 * 修改记录：
 *===============================================================
 * 日    期          修改人      修改类型
 * 2021-02-21         李勇    	创建
==============================================================*/
uint8_t get_buttonkey_gpio_status(void);
/*=============================================================
 *  函数名称：BluetoothCommunicationStatus
 * 函数功能：蓝牙通讯状态获取
 * 参数个数：
 * 参数描述：
 * 返 回 值：1
 *           
 * 修改记录：
 *===============================================================
 * 日    期          修改人      修改类型
 * 2022-01-19           李勇    	创建
==============================================================*/
uint8_t BluetoothCommunicationStatus(void);
/*=============================================================
 *  函数名称：BluetoothDelayProcess
 * 函数功能：蓝牙通讯延时
 * 参数个数：
 * 参数描述：
 * 返 回 值：1
 *           
 * 修改记录：
 *===============================================================
 * 日    期          修改人      修改类型
 * 2022-01-19         李勇    	创建
==============================================================*/
void BluetoothDelayProcess(void);
extern uint8_t g_send_over_flag;
#endif 
