/*
 * charger_addition_process.h
 *
 *  Created on: 2018年10月20日
 *      Author: daihuifa
 */

#ifndef CH_ADDITION_H_
#define CH_ADDITION_H_

#include <stdint.h>

/*=============================================================
* 函数名称：ch_addition_mem_init
* 函数功能：充电辅助模块内存初始化
* 参数个数：0
* 参数描述：
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期                     修改人            修改类型
* 2018-10-20       	戴辉发     	创建
==============================================================*/
void ch_addition_mem_init(void);

/*=============================================================
 * 函数名称：ch_addition_full_flag
 * 函数功能：充电辅助模块满充标识内存初始化
 * 参数个数：0
 * 参数描述：
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期          修改人           修改类型
 * 2020-09-16        戴辉发           创建
==============================================================*/
void ch_addition_full_flag(void);

/*=============================================================
 * 函数名称：set_ch_full_flag
 * 函数功能：设定满充标识标志
 * 参数个数：0
 * 参数描述：
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期          修改人           修改类型
 * 2020-09-16        戴辉发           创建
==============================================================*/
void set_ch_full_flag(uint8_t flag);

/*=============================================================
 * 函数名称：get_ch_full_flag
 * 函数功能：获取满充标识
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 *          满充标识
 * 修改记录：
 *===============================================================
 * 日    期          修改人           修改类型
 * 2020-09-16        戴辉发           创建
==============================================================*/
uint8_t getChFullFlag(void);
/*=============================================================
 * 函数名称：get_ch_link_status
 * 函数功能：获取充电器接入状态
 * 参数个数：0
 * 参数描述：
 * 返 回 值：无
 * 修改记录：
 *=============================================================
 * 日    期          修改人           修改类型
 * 2021-07-18        戴辉发           创建
 ==============================================================*/
uint8_t get_ch_link_status(void);
void SetRecivedChargerMessFlag(uint8_t flag);
uint8_t GetRecivedChargerMessFlag(void);
/*==============================================================
 * 函数名称：ch_addition_timer
 * 函数功能：CAN APP定时器，100毫秒定时器
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *           无
 * 修改记录:
 *===============================================================
 * 日    期                     修改人            修改类型
 * 2018-10-20        戴辉发           创建
==============================================================*/
void ch_addition_timer(void);

/*==============================================================
* 函数名称：ch_addition_process
* 函数功能：充电附加模块处理流程
* 参数个数：0
* 函数参数：
* 返 回 值：
*           无
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2018-07-11          戴辉发             创建
==============================================================*/
void ch_addition_process(void);

/*=============================================================
 * 函数名称：judge_ch_finished
 * 函数功能：判断充电完成标识
 * 参数个数：0
 * 参数描述：
 * 返 回 值：0       充电未完成
 *           1      充电完成
 * 修改记录：
 *===============================================================
 * 日    期             修改人          修改类型
 * 2019-04-05       	戴辉发     	   创建
==============================================================*/
uint8_t judge_ch_finished(void);

/*=============================================================
 * 函数名称：judge_ch_float
 * 函数功能：判断充电完成标识
 * 参数个数：0
 * 参数描述：
 * 返 回 值： 0       未完成状态
 *          1       完成状态
 * 修改记录：
 *===============================================================
 * 日    期                     修改人            修改类型
 * 2018-10-20        戴辉发           创建
==============================================================*/
uint8_t judge_ch_float(void);

/*=============================================================
 * 函数名称：send_closed_rxpdo_to_charger
 * 函数功能：发送关闭充电机命令请求
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *          无
 * 修改记录:
 *===============================================================
 * 日期                修改人             修改内容
 * 2018-10-21          戴辉发             创建
==============================================================*/
void send_closed_rxpdo_to_charger(void);

/*==============================================================
 * 函数名称：ch_addition_judge_process
 * 函数功能：充电器错误状态判决，主要判决功率先断开环节
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *          0          无错误
 *          1          错误状态
 * 修改记录:
 *==============================================================
 * 日期                             修改人             修改内容
 * 2019-07-03          戴辉发             创建
==============================================================*/
void ch_addition_judge_process(void);

/*=============================================================
 * 函数名称：ch_data_indication
 * 函数功能：充电器响应数据
 * 参数个数：1
 * 参数描述：
 *          [IN]     data_buf    当前电流
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期                     修改人            修改类型
 * 2018-10-20        戴辉发           创建
==============================================================*/
void ch_data_indication(uint8_t *data_buf);

/*=============================================================
* 函数名称：soc_update_process
* 函数功能：SOC充电末端校准
* 参数个数：0
* 参数描述：
* 返 回 值：
*          无
* 修改记录：
*===============================================================
* 日    期                      修改人                  修改类型
* 2019-09-05       	戴辉发     	       创建
==============================================================*/
void soc_update_process(void);

/*=============================================================
 * 函数名称：send_nmt_to_net
 * 函数功能：发送广播命令
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *          无
 * 修改记录:
 *===============================================================
 * 日期                修改人             修改内容
 * 2018-10-21          戴辉发             创建
==============================================================*/
void ch_addition_full_process(void);
   /*=============================================================
* 函数名称：send_rystate_to_charger
* 函数功能：发送充电机
* 参数个数：3
* 函数参数：
*          [IN]       voltage      充电电压
*          [IN]       current      充电电流
*          [IN]       flag         充电禁止允许标志
* 返 回 值：
*          无
* 修改记录:
*===============================================================
* 日期                             修改人             修改内容
* 2018-10-21          戴辉发             创建
==============================================================*/
void send_rystate_to_charger(uint16_t voltage, uint16_t current, uint8_t flag);

#endif /* CH_ADDITION_H_ */
