#ifndef _CLEAR_SWD_DEFINE_
#define _CLEAR_SWD_DEFINE_

extern uint8_t g_clear_swd_flag;

/*=============================================================
* 函数名称：clear_swd_mem_init
* 函数功能：清除SWD接口
* 参数个数：0
* 参数描述：
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-10-31       	戴辉发     	创建
==============================================================*/
void clear_swd_mem_init(void);

/*=============================================================
* 函数名称：clear_swd_1s_timer_process
* 函数功能：SWD功能清除定时器
* 参数个数：0
* 参数描述：
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-10-31       	戴辉发     	创建
==============================================================*/
void clear_swd_1s_timer_process(void);

/*=============================================================
* 函数名称：config_swd_function
* 函数功能：配置SWD功能
* 参数个数：0
* 参数描述：
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-10-31       	戴辉发     	创建
==============================================================*/
void config_swd_function(void);

/*=============================================================
* 函数名称：swd_process
* 函数功能：SWD功能处理函数
* 参数个数：0
* 参数描述：
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-10-31       	戴辉发     	创建
==============================================================*/
void swd_process(void);

#endif
