/**************************/
#ifndef _CURRENT_MANAGE_DEFINE_
#define _CURRENT_MANAGE_DEFINE_

#include <stdint.h>

/* 电流检测失效标识判别 */
#define CURRECT_DECTECT_FAULT(a)         ((a) == E_C_FAULT)

/************************ 放电电流判别 ************************/
/* a为放电电流 */
#define CURRENT_IN_DISCHARGE(a)          (((a) == E_C_DCH) || ((a) == E_C_SECOND_PROTECT) || ((a) == E_C_DCH_PROTECT) || ((a) == E_C_DCH_ALARM))
#define CURRENT_IN_DISCHARGE_IDLE(a)     ((a) == E_C_DCH) /* 放电电流 */
#define CURRENT_IN_DISCHARGE_ALARM(a)    ((a) == E_C_DCH_ALARM) /* 放电过流告警 */
#define CURRENT_IN_DISCHARGE_PROTECT(a)  ((a) == E_C_DCH_PROTECT) /* 放电过流保护 */
#define CURRENT_IN_DISCHARGE_SECOND(a)   ((a) == E_C_SECOND_PROTECT) /* 放电二次过流保护 */
#define CURRENT_IN_DISCHARGE_LOWPOWER(a) ((a) == E_LOW_POWER_OVER) /* 低电量过流保护 */
#define CURRENT_IN_DISCHARGE_COMMON(a)   (((a) == E_C_DCH) || ((a) == E_C_DCH_ALARM)) 

/************************ 充电电流判别 ************************/
/* a为充电电流 */
#define CURRENT_IN_CHARGE(a)             (((a) == E_C_CH) || ((a) == E_C_CH_ALARM) || ((a) == E_C_CH_PROTECT))
#define CURRENT_IN_CHARGE_IDLE(a)        ((a) == E_C_CH) /* 充电电流 */
#define CURRENT_IN_CHARGE_ALARM(a)       ((a) == E_C_CH_ALARM) /* 充电过流告警 */
#define CURRENT_IN_CHARGE_PROTECT(a)     ((a) == E_C_CH_PROTECT) /* 充电过流保护 */
#define CURRENT_IN_CHARGE_COMMON(a)      (((a) == E_C_CH) || ((a) == E_C_CH_ALARM))

/************************ 待机电流判别 ************************/
#define CURRENT_IN_IDLE(a)               ((a) == E_C_IDLE)

/* 电流状态 */
typedef enum _E_CURRENT_STATUS_
{
	E_C_SECOND_PROTECT, /* 放电二次过流保护 */
	E_C_DCH_PROTECT, /* 放电过流保护 */
	E_C_DCH_ALARM, /* 放电过流告警 */
	E_C_DCH, /* 正常放电电流 */
	E_C_IDLE, /* 待机电流 */ 
	E_C_CH, /* 正常待机电流 */
	E_C_CH_ALARM, /* 充电过流告警 */ 
	E_C_CH_PROTECT, /* 充电过流保护 */ 
    E_C_FAULT
}e_current_status;

extern uint16_t g_vref_cpu_value;
extern float g_verf_ad_value;

/*=============================================================
 * 函数名称：c_timer_ms_run
 * 函数功能：电流管理模块毫秒级定时器
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *           无
 * 修改记录：
 *==============================================================
 * 日期                修改人             修改内容
 * 2018-06-27          戴辉发             创建
==============================================================*/
void c_timer_ms_run(void);

/*=============================================================
 * 函数名称：current_mem_init
 * 函数功能：电流管理模块内存初始化
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *           无
 * 修改记录：
 *==============================================================
 * 日期                修改人             修改内容
 * 2018-06-27          戴辉发             创建
==============================================================*/
void current_mem_init(void);

/*=============================================================
 * 函数名称：get_cur_current
 * 函数功能：获取当前工作电流
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *           返回当前工作电流，单位为0.01A
 * 修改记录：
 *==============================================================
 * 日期                修改人             修改内容
 * 2018-07-11          戴辉发             创建
==============================================================*/
int16_t get_cur_current(void);

/*=============================================================
 * 函数名称：current_data_init
 * 函数功能：电流管理模块与硬件相关数据初始化
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *           无
 * 修改记录：
 *==============================================================
 * 日期                修改人             修改内容
 * 2018-07-07          戴辉发             创建
==============================================================*/
void current_data_init(void);

/*=============================================================
 * 函数名称：get_current_power_flag
 * 函数功能：获取当前电流功率状态
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *           获取当前电流功率状态
 * 修改记录：
 *==============================================================
 * 日期                修改人             修改内容
 * 2018-07-05          戴辉发             创建
==============================================================*/
uint8_t get_current_power_flag(void);

/*=============================================================
 * 函数名称：get_current_status
 * 函数功能：获取当前电流模块状态
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *           当前电流模块状态
 * 修改记录：
 *==============================================================
 * 日期                修改人             修改内容
 * 2018-06-28          戴辉发             创建
==============================================================*/
e_current_status get_current_status(void);

/*=============================================================
 * 函数名称：get_work_current
 * 函数功能：获取电流
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *           电流值
 * 修改记录：
 *==============================================================
 * 日期                修改人             修改内容
 * 2018-06-28          戴辉发             创建
==============================================================*/
int16_t get_work_current(int16_t c_ad);

/*=============================================================
 * 函数名称：current_get_process
 * 函数功能：电流获取过程
 * 参数个数：1
 *          [IN]       ad_value          AD值
 * 函数参数：
 * 返 回 值：
 * 修改记录：
 *==============================================================
 * 日期                修改人             修改内容
 * 2018-07-06          戴辉发             创建
==============================================================*/
uint8_t current_get_process(int16_t ad_value);

/*=============================================================
 * 函数名称：current_managment_process
 * 函数功能：电流处理流程
 * 参数个数：1
 * 函数参数：
 *           [IN]      current            电流值
 * 返 回 值：
 *           无
 * 修改记录：
 *==============================================================
 * 日期                修改人             修改内容
 * 2018-06-27          戴辉发             创建
==============================================================*/
void current_managment_process(void);

/*=============================================================
 * 函数名称：get_real_current
 * 函数功能：获取当前实时电流
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *          实时电流
 * 修改记录：
 *==============================================================
 * 日期                修改人             修改内容
 * 2019-08-22          戴辉发             创建
==============================================================*/
int16_t get_real_current(void);
/*=============================================================
 * 函数名称：init_low_power_status
 * 函数功能：初始化低功耗管理模块状态
 * 参数个数：0
 * 参数描述：
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期          修改人      修改类型
 * 2020-06-29        liyong     	创建
==============================================================*/
uint8_t get_small_current_in_sheep();
/*=============================================================
 * 函数名称：get_current_offset_poweron
 * 函数功能：开机进行0点校准
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *           
 * 修改记录：
 *==============================================================
 * 日期                修改人             修改内容
 * 2021-06-08          liyong             创建
==============================================================*/
uint8_t get_current_offset_poweron(void);
     
#if defined(TIANFENG) && defined(BAT_8S)
/*=============================================================
 * 函数名称：getTfLowTempCurrDisCHFlag
 * 函数功能：获取小于0℃，充电电流大于0.5A禁充标志
 * 参数描述：无
 * 返 回 值：1禁充
            0 正常
 * 修改记录：
 *==============================================================
 * 日期                修改人             修改内容
 * 2024-03-13           Fanyl             创建
==============================================================*/
uint8_t getTfLowTempCurrDisCHFlag(void);
#endif
#endif
