/*---------------------------------------------------------*
* Copyright (C) 2018 杭州优恩捷科技有限公司。版权所有。
*
* 文件名：fault_manage.h
* 文件功能描述：实现控制板故障管理管理
*
* 修改记录：
* 2018-11-14 戴辉发 创建
*----------------------------------------------------------*/
#ifndef _FAULT_MANAGE_DEFINE_
#define _FAULT_MANAGE_DEFINE_

#include <stdint.h>
#define RELAY_CTRL_GPIO         FL_GPIO_PIN_5
#define RELAY_CTRL_GPIO_GROUP   GPIOB

#define RELAY_EXIST_GPIO        FL_GPIO_PIN_4
#define RELAY_EXIST_GPIO_GROUP  GPIOB

/*=============================================================
* 函数名称：fault_manage_mem_init
* 函数功能：充放电开关故障管理内存初始化
* 参数个数：0
* 参数描述：
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-11-14       	戴辉发     	创建
==============================================================*/
void fault_manage_mem_init(void);

/*=============================================================
* 函数名称：relay_on
* 函数功能：二次保护继电器闭合
* 参数个数：0
* 参数描述：
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-11-14       	戴辉发     	创建
==============================================================*/
void relay_on(void);

/*=============================================================
* 函数名称：relay_off
* 函数功能：二次保护继电器断开
* 参数个数：0
* 参数描述：
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-11-14       	戴辉发     	创建
==============================================================*/
void relay_off(void);

/*=============================================================
* 函数名称：fault_manage_timer_10ms_run
* 函数功能：故障管理模块定时器
* 参数个数：0
* 函数参数：
* 返 回 值：
*           无
* 修改记录：
*===============================================================
* 日期                修改人             修改内容
* 2018-11-14          戴辉发             创建
==============================================================*/
void fault_manage_timer_ms_run(void);

/*=============================================================
* 函数名称：获取与采样芯片通信标志
* 函数功能：故障管理模块定时器
* 参数个数：0
* 函数参数：
* 返 回 值：
*           无
* 修改记录：
*===============================================================
* 日期                修改人             修改内容
* 2018-11-15          戴辉发             创建
==============================================================*/
uint8_t get_fet_communication_flag(void);

/*=============================================================
* 函数名称：fet_detect_process
* 函数功能：充放电开关检测流程
* 参数个数：0
* 参数描述：
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-11-14       	戴辉发     	创建
==============================================================*/
void fet_detect_process(void);

/*=============================================================
* 函数名称：fet_fault_deal_process
* 函数功能：充放电开关故障处理流程
* 参数个数：0
* 参数描述：
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-11-14       	戴辉发     	创建
==============================================================*/
void fet_fault_deal_process(void);

/*=============================================================
* 函数名称：get_backup_relay_deal
* 函数功能：故障管理模块定时器
* 参数个数：0
* 函数参数：
* 返 回 值：
*           无
* 修改记录：
*===============================================================
* 日期                修改人             修改内容
* 2020-06-15          liyong             创建
==============================================================*/
uint8_t get_backup_relay_deal(void);

/*=============================================================
* 函数名称：get_backup_relay_fault
* 函数功能：故障管理模块定时器
* 参数个数：0
* 函数参数：
* 返 回 值：
*           无
* 修改记录：
*===============================================================
* 日期                修改人             修改内容
* 2020-06-15          liyong             创建
==============================================================*/
uint8_t get_backup_relay_fault(void);

/*=============================================================
* 函数名称：get_backup_relay_in
* 函数功能：获取二次模块是否存在
* 参数个数：0
* 函数参数：
* 返 回 值：
*           无
* 修改记录：
*===============================================================
* 日期                修改人             修改内容
* 2020-06-15          liyong             创建
==============================================================*/
uint8_t get_backup_relay_in(void);

/*=============================================================
* 函数名称：set_fail_cutoff_flag
* 函数功能：设置通讯断开辅助继电器
* 参数个数：0
* 参数描述：
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2020-06-16      	liyong     	创建
==============================================================*/
void set_fail_cutoff_flag(uint8_t vaule);
/*=============================================================
* 函数名称：get_fail_cutoff_flag
* 函数功能：设置通讯断开辅助继电器
* 参数个数：0
* 参数描述：
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2020-06-16      	liyong     	创建
==============================================================*/
uint8_t get_fail_cutoff_flag(void);

/*=============================================================
* 函数名称：GetBackupRelayStatus
* 函数功能：获取二次执行继电器状态
* 参数个数：0
* 参数描述：
* 返 回 值：
*           0       断开
*           1       闭合
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2023-07-06        李勇              创建
==============================================================*/
uint8_t GetBackupRelayStatus(void);
#endif
