/*---------------------------------------------------------*
* Copyright (C) 2018 杭州优恩捷科技有限公司。版权所有。
*
* 文件名：iap_app.h
* 文件功能描述：实现IAP跳转
*
* 修改记录：
* 2018-08-24 戴辉发 创建
*----------------------------------------------------------*/
#ifndef _IAP_APP_DEFINE_
#define _IAP_APP_DEFINE_
#include <stdint.h>
/*=============================================================
* 函数名称：start_iap_process
* 函数功能：跳转到IAP模块
* 参数个数：0
* 参数描述：
* 返 回 值：
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-08-24       	戴辉发     	创建
==============================================================*/
void start_iap_process(void);
/*=============================================================
 * 函数名称：update_record_mem_init
 * 函数功能：均衡模块计数值初始化
 * 参数个数：
 * 函数参数：
 * 返 回 值：
 *           无
 * 修改记录:
 *==============================================================
 * 日期             修改人     修改内容
 * 2020-6-22        liyong    创建
==============================================================*/
void update_record_mem_init(void);
/*=============================================================
 * 函数名称：balance_record_hard_init
 * 函数功能：均衡模块计数值初始化
 * 参数个数：0
 * 参数描述：
 *
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期                     修改人         修改类型
 * 2020-06-03        liyong       创建
==============================================================*/
void update_record_hard_init(void);
/*=============================================================
 * 函数名称：f_DisenableReadProtection
 * 函数功能：设置读取不保护
 * 参数个数：0
 * 参数描述：
 *
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期                     修改人         修改类型
 * 2020-07-13                  liyong         创建
==============================================================*/
void f_DisenableReadProtection(void);
/*=============================================================
 * 函数名称：Set_readProtect
 * 函数功能：设置读取保护
 * 参数个数：0
 * 参数描述：
 *
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期                     修改人         修改类型
 * 2020-07-13                  liyong         创建
==============================================================*/
void Set_readProtect(void);
#endif

