#ifndef _LOW_POWER_DEFINE_
#define _LOW_POWER_DEFINE_

#include "stdint.h"

extern uint32_t PowerOnCount;
extern uint32_t setFactroyModeDelay;

/*=============================================================
* 函数名称：low_m_timer_process
* 函数功能：低功耗定时器处理模块, 1s调用一次
* 参数个数：0
* 参数描述：
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-06-23       	戴辉发     	创建
==============================================================*/
void low_m_timer_process(void);

void AddSocPowerOnCount(void);

uint8_t GetPowerOnOverOneDay(void);

void UpdatePowerOnCount(uint32_t times);

void PowerCountInit(void);

void UpdateFactroyModeDelay(uint32_t times);

/*=============================================================
* 函数名称：low_m_timer_process
* 函数功能：低功耗定时器处理模块
* 参数个数：0
* 参数描述：
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-10-30       	戴辉发     	创建
==============================================================*/
void low_10ms_timer_process(void);

/*==============================================================
* 函数名称：low_power_mem_init
* 函数功能：低功耗管理模块内存初始化
* 参数个数：0
* 参数描述：
* 
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-06-23       	戴辉发     	创建
==============================================================*/
void low_power_mem_init(void);

/*=============================================================
* 函数名称：init_low_power_status
* 函数功能：初始化低功耗管理模块状态
* 参数个数：0
* 参数描述：
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-10-30       	戴辉发     	创建
==============================================================*/
void init_low_power_status(void);

/*==============================================================
* 函数名称：low_power_manage
* 函数功能：低功耗管理模块处理流程
* 参数个数：0
* 参数描述：
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-06-23       	戴辉发     	创建
==============================================================*/
void low_power_manage(void);

/*=============================================================
* 函数名称：deactive_manage
* 函数功能：系统不活动管理模块处理流程
* 参数个数：0
* 参数描述：
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-06-23       	戴辉发     	创建
==============================================================*/
void deactive_manage(void);

void set_t_deactive_time(uint16_t delay_num);

/*=============================================================
* 函数名称：low_power_process
* 函数功能：低功耗处理流程
* 参数个数：0
* 参数描述：
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-10-16       	戴辉发     	创建
==============================================================*/
void low_power_process(void);
/*******************************************************************************
**FuncName: get_send_charger_flag;//
**Function: 获取send_charger_flag;
**Output  : 无;
**input   : 无;
**Create date : liyong @2021/4/25
**Modify  : 
*******************************************************************************/
uint8_t get_send_charger_flag(void);
#endif
