/*
 * mode_manage.h
 *
 *  Created on: 2018年10月19日
 *      Author: daihuifa
 */

#ifndef MODE_MANAGE_H_
#define MODE_MANAGE_H_

/* 模式管理状态 */
typedef enum _E_MODE_STATUS_
{
	E_MODE_INIT_STATUS, /* 初始化状态 */
	E_MODE_NORMAL_STATUS, /* 正常模式状态 */
	E_MODE_SLEEP_STATUS, /* 睡眠模式 */
	E_MODE_MAX_STATUS_NUM
}e_mode_status;

/*=============================================================
* 函数名称：mode_manage_mem_init
* 函数功能：模式管理模块内存初始化
* 参数个数：0
* 参数描述：
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期                     修改人            修改类型
* 2018-10-19       	戴辉发     	创建
==============================================================*/
void mode_manage_mem_init(void);

/*==============================================================
* 函数名称：mode_manage_timer
* 函数功能：模式管理模块定时器
* 参数个数：0
* 函数参数：
* 返 回 值：
*          无
* 修改记录:
*===============================================================
* 日期                          修改人             修改内容
* 2019-07-10       	戴辉发     	  创建
==============================================================*/
void mode_manage_timer(void);

/*=============================================================
 * 函数名称：get_harddwg_flag
 * 函数功能：获取硬件喂狗标志
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 *          0           硬件喂狗
 *          1           硬件不喂狗
 * 修改记录：
 *===============================================================
 * 日    期             修改人       修改类型
 * 2020-03-20           戴辉发     	创建
==============================================================*/
uint8_t get_harddwg_flag(void);

/*=============================================================
* 函数名称：get_system_mode_status
* 函数功能：获取系统模式
* 参数个数：0
* 参数描述：
* 返 回 值：
*          当前系统模式
* 修改记录：
*===============================================================
* 日    期                     修改人            修改类型
* 2018-10-19       	戴辉发     	创建
==============================================================*/
e_mode_status get_system_mode_status(void);

/*=============================================================
* 函数名称：mode_sleep_status_process
* 函数功能：模式管理模块睡眠状态处理流程
* 参数个数：0
* 参数描述：
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期                     修改人            修改类型
* 2018-10-19       	戴辉发     	创建
==============================================================*/
void mode_sleep_status_process(void);

/*=============================================================
* 函数名称：mode_key_status_indication
* 函数功能：模式管理模块开关状态指示
* 参数个数：0
* 参数描述：
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期                     修改人            修改类型
* 2018-10-19       	戴辉发     	创建
==============================================================*/
void mode_key_status_indication(void);

/*=============================================================
* 函数名称：mode_idle_timer_indication
* 函数功能：模式管理模块小电流指示
* 参数个数：0
* 参数描述：
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期                     修改人            修改类型
* 2018-10-19       	戴辉发     	创建
==============================================================*/
void mode_idle_timer_indication(void);

/*=============================================================
* 函数名称：mode_low_power_timer_indication
* 函数功能：模式管理模块低功耗定时指示
* 参数个数：0
* 参数描述：
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期                     修改人            修改类型
* 2018-10-19       	戴辉发     	创建
==============================================================*/
void mode_low_power_timer_indication(void);

/*=============================================================
* 函数名称：mode_low_power_overload_indication
* 函数功能：模式管理模块低功耗过载指示
* 参数个数：0
* 参数描述：
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期                     修改人            修改类型
* 2018-10-19       	戴辉发     	创建
==============================================================*/
void mode_low_power_overload_indication(void);

/*=============================================================
* 函数名称：mode_sample_status_indication
* 函数功能：模式管理模块采样状态指示
* 参数个数：0
* 参数描述：
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期                     修改人            修改类型
* 2018-10-19       	戴辉发     	创建
==============================================================*/
void mode_sample_status_indication(void);

/*=============================================================
* 函数名称：mode_power_invalid_indication
* 函数功能：模式管理模块主电源不正确指示
* 参数个数：0
* 参数描述：
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-10-19       	戴辉发     	创建
==============================================================*/
void mode_power_invalid_indication(void);

#endif /* MODE_MANAGE_H_ */
