/*---------------------------------------------------------*
 * Copyright (C) 2018 杭州优恩捷科技有限公司。版权所有。
 *
 * 文件名：peak_record.c
 * 文件功能描述：实现系统复位次数
 *
 * 修改记录：
 * 2019-11-18 戴辉发   创建
*----------------------------------------------------------*/

#ifndef _PEAK_RECORD_DEFINE_
#define _PEAK_RECORD_DEFINE_

#include <stdint.h>

typedef struct 
{
   int16_t ultimatevaule;
   uint8_t time[6];
}ULTIMATE;


typedef struct
{
   int16_t ultimatevaule;
   int16_t location;
   uint8_t time[6];
}ULTIMATE_ADR;
/* 极值参数结构 */
typedef struct _PEAK_RECORD_STRUCT1_
{
    ULTIMATE_ADR max_vol; /* 最大单体电压 */
    ULTIMATE_ADR min_vol; /* 最小单体电压 */
    ULTIMATE max_totalvol;/* 最大总电压 */
    ULTIMATE min_totalvol;/* 最小总电压 */
    ULTIMATE max_current; /* 最大充电电流 */
    ULTIMATE min_current; /* 最大放电电流 */
	uint32_t number;
}t_peak_record_st1;
/* 极值参数结构 */
typedef struct _PEAK_RECORD_STRUCT2_
{
    ULTIMATE_ADR max_celltemp; /* 最高电芯温度 */
    ULTIMATE_ADR min_celltemp; /* 最低电芯温度 */
    ULTIMATE max_powtemp; /* 最高功率温度 */
    ULTIMATE min_powtemp; /* 最低功率温度 */
    ULTIMATE max_envtemp; /* 最高环境温度 */
    ULTIMATE min_envtemp; /* 最低环境温度 */
	uint32_t number;
}t_peak_record_st2;
extern t_peak_record_st1 g_peak_record1;
extern t_peak_record_st2 g_peak_record2;


/*=============================================================
 * 函数名称：peak_record_mem_init
 * 函数功能：极限数字模块内存初始化
 * 参数个数：0
 * 参数描述：
 * 
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期          修改人         修改类型
 * 2019-11-18        戴辉发         创建
==============================================================*/
void peak_record_mem_init(void);

/*=============================================================
 * 函数名称：peak_record_timer
 * 函数功能：极限数字模块定时器
 * 参数个数：0
 * 参数描述：
 * 
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期          修改人         修改类型
 * 2019-11-18        戴辉发         创建
==============================================================*/
void peak_record_timer(void);

/*=============================================================
 * 函数名称：peak_second_timer
 * 函数功能：极限数字模块秒级定时器
 * 参数个数：0
 * 参数描述：
 *
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期                      修改人         修改类型
 * 2019-11-18        戴辉发         创建
==============================================================*/
void peak_second_timer(void);

/*=============================================================
 * 函数名称：peak_record_process
 * 函数功能：极限数字模块处理流程
 * 参数个数：0
 * 参数描述：
 * 
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期          修改人         修改类型
 * 2019-11-18        戴辉发         创建
==============================================================*/
void peak_record_process(void);

/*=============================================================
 * 函数名称：peak_record_hard_init
 * 函数功能：极限数字模块数据读取
 * 参数个数：0
 * 参数描述：
 * 
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期          修改人         修改类型
 * 2019-11-18        戴辉发         创建
==============================================================*/
void peak_record_hard_init(void);

/*=============================================================
 * 函数名称：save_peak1_record
 * 函数功能：保存当前极值记录
 * 参数个数：0
 * 参数描述：
 *
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期                     修改人         修改类型
 * 2019-11-18        戴辉发         创建
==============================================================*/
void save_peak1_record(void);
/*=============================================================
 * 函数名称：save_peak1_record
 * 函数功能：保存当前极值记录
 * 参数个数：0
 * 参数描述：
 *
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期                     修改人         修改类型
 * 2019-11-18        戴辉发         创建
==============================================================*/
void save_peak2_record(void);
/*=============================================================
 * 函数名称：set_max_cell
 * 函数功能：设置最高电压
 * 参数个数：1
 * 参数描述：
 *          [IN]    max_vol     电芯最高电压
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期          修改人       修改类型
 * 2019-11-18        戴辉发       创建
==============================================================*/
void set_max_cell(uint16_t max_vol);

/*=============================================================
 * 函数名称：set_min_cell
 * 函数功能：设置最低电压
 * 参数个数：1
 * 参数描述：
 *          [IN]    min_vol     电芯最低电压
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期          修改人       修改类型
 * 2019-11-18        戴辉发       创建
==============================================================*/
void set_min_cell(uint16_t min_vol);

/*=============================================================
 * 函数名称：set_max_current
 * 函数功能：设置最高充电电流
 * 参数个数：1
 * 参数描述：
 *          [IN]    max_current   电流
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期          修改人       修改类型
 * 2019-11-18        戴辉发       创建
==============================================================*/
void set_max_current(int16_t max_current);

/*=============================================================
 * 函数名称：set_min_current
 * 函数功能：设置最大放电电流
 * 参数个数：1
 * 参数描述：
 *          [IN]     min_current  电流
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期          修改人       修改类型
 * 2019-11-18        戴辉发       创建
==============================================================*/
void set_min_current(int16_t min_current);

/*=============================================================
 * 函数名称：set_max_celltemp
 * 函数功能：设置最高电芯温度
 * 参数个数：1
 * 参数描述：
 *          [IN]    max_celltemp  电芯温度
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期          修改人       修改类型
 * 2019-11-18        戴辉发       创建
==============================================================*/
void set_max_celltemp(int16_t max_celltemp);

/*=============================================================
 * 函数名称：set_min_celltemp
 * 函数功能：设置最低电芯温度
 * 参数个数：1
 * 参数描述：
 *          [IN]     min_celltemp 电芯温度
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期          修改人       修改类型
 * 2019-11-18        戴辉发       创建
==============================================================*/
void set_min_celltemp(int16_t min_celltemp);

/*=============================================================
 * 函数名称：set_max_envtemp
 * 函数功能：设置最高环境温度
 * 参数个数：1
 * 参数描述：
 *          [IN]    max_envtemp   环境温度
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期          修改人       修改类型
 * 2019-11-18        戴辉发       创建
==============================================================*/
void set_max_envtemp(int16_t max_envtemp);

/*=============================================================
 * 函数名称：set_min_envtemp
 * 函数功能：设置最低环境温度
 * 参数个数：1
 * 参数描述：
 *          [IN]     min_envtemp  环境温度
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期          修改人       修改类型
 * 2019-11-18        戴辉发       创建
==============================================================*/
void set_min_envtemp(int16_t min_envtemp);

/*=============================================================
 * 函数名称：set_max_powtemp
 * 函数功能：设置最高功率温度
 * 参数个数：1
 * 参数描述：
 *          [IN]    max_envtemp   功率温度
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期          修改人       修改类型
 * 2019-11-18        戴辉发       创建
==============================================================*/
void set_max_powtemp(int16_t max_powtemp);

/*=============================================================
 * 函数名称：set_min_powtemp
 * 函数功能：设置最低功率温度
 * 参数个数：1
 * 参数描述：
 *          [IN]     min_powtemp  功率温度
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期          修改人       修改类型
 * 2019-11-18        戴辉发       创建
==============================================================*/
void set_min_powtemp(int16_t min_powtemp);

/*=============================================================
 * 函数名称：set_max_volt
 * 函数功能：最高总电压
 * 参数个数：1
 * 参数描述：
 *          [IN]    max_vol     最高总电压
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期                     修改人       修改类型
 * 2020-6-3                     李勇       创建
==============================================================*/
void set_max_volt(uint16_t max_vol);
/*=============================================================
 * 函数名称：set_min_volt
 * 函数功能：最高总电压
 * 参数个数：1
 * 参数描述：
 *          
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期                     修改人       修改类型
 * 2020-6-3                     李勇       创建
==============================================================*/
void set_min_volt(uint16_t min_vol);
/*=============================================================
 * 函数名称：reset_peak_record
 * 函数功能：极值数据清空
 * 参数个数：0
 * 参数描述：
 *         
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期                     修改人       修改类型
 * 2020-10-13                   liyong       创建
==============================================================*/
void reset_peak_record();
#endif
