#ifndef _RUN_RECORD_DEFINE_
#define _RUN_RECORD_DEFINE_

#include "stdint.h"
#include "parameter.h"

#define DATETIME_LENGTH                            (7)

/* 实时数据 */
typedef struct _RUN_RECORD_DATA_STRUCT_
{
	uint16_t total_vol; /* 当前总压 */
	short current; /* 当前工作电流 */
	uint16_t soc; /* 当前SOC */
	uint16_t cell_vol[MAX_BAT_NUM]; /* 电芯电压 */
	short power_temp; /* 功率温度 */
	short ambient_temp; /* 环境温度 */
	short cell_temp[MAX_CELL_TEMP_NUM]; /* 电芯温度 */
	uint8_t vol_event; /* 电压事件 */
	uint8_t cur_event; /* 电流事件 */
	uint8_t temp_event; /* 温度事件 */
	uint8_t ba_event; /* 均衡事件 */
	uint8_t cap_event; /* 容量事件 */
	uint8_t other_event; /* 其他事件 */
    uint8_t new_event1; /* 新增事件1 */
    uint8_t new_event2; /* 新增事件2 */
    uint8_t write_time[DATETIME_LENGTH]; /* 写入事件时时间 */ //61byte
    uint16_t number;
}t_run_record_data;

extern uint16_t g_first_index; /* 读取第一条记录位置 */
extern t_run_record_data g_read_run_record; /* 前次系统运行参数 */
extern t_run_record_data g_read_protect; /* 前次系统保护参数 */

extern uint32_t read_rundata_adr;       /* 记录读取运行记录的地址 */ 
extern uint32_t read_protectdata_adr;   /* 记录读取保护记录的地址 */
extern uint8_t record_protect;

extern uint8_t write_rundata_flag;
extern uint16_t write_rundata_delay; 
/*=============================================================
* 函数名称：run_recorde_mem_init
* 函数功能：运行记录管理内存初始化
* 参数个数：
* 函数参数：
* 返 回 值：
*           无
* 修改记录:
*===============================================================
* 日期             修改人     修改内容
* 2018-06-22       戴辉发     创建
==============================================================*/
void run_recorde_mem_init(void);

/*=============================================================
* 函数名称：run_record_hard_init
* 函数功能：运行记录管理硬件初始化
* 参数个数：
* 函数参数：
* 返 回 值：
*           无
* 修改记录:
*===============================================================
* 日期             修改人     修改内容
* 2018-06-22       戴辉发     创建
==============================================================*/
void run_record_hard_init(void);

/*=============================================================
* 函数名称：write_run_record
* 函数功能：写入当前系统运行状态
* 参数个数：0
* 函数参数：
* 返 回 值：
* 修改记录：
*===============================================================
* 日期                修改人        修改内容
* 2018-06-22          戴辉发        创建
==============================================================*/
void write_run_record(void);

/*=============================================================
* 函数名称：read_first_record
* 函数功能：读取第一条系统运行记录
* 参数个数：0
* 函数参数：
* 返 回 值：
*           读取到的数据长度，为0读取不成功
* 修改记录：
*===============================================================
* 日期               修改人     修改内容
* 2018-09-14         戴辉发     创建
==============================================================*/
uint8_t read_first_run_record(void);

/*=============================================================
* 函数名称：read_first_record
* 函数功能：读取下一条系统运行记录
* 参数个数：0
* 函数参数：
* 返 回 值：
*           读取到的数据长度，为0读取不成功
* 修改记录：
*===============================================================
* 日期               修改人     修改内容
* 2018-09-14         戴辉发     创建
==============================================================*/
uint8_t read_next_run_record(void);
/*=============================================================
* 函数名称：write_run_record
* 函数功能：写入系统保护状态
* 参数个数：0
* 函数参数：
* 返 回 值：
* 修改记录：
*===============================================================
* 日期                修改人        修改内容
* 2020-06-2           李勇          创建
==============================================================*/
void write_protect_record(void);

/*=============================================================
* 函数名称：read_first_protect_record
* 函数功能：读取第一条系统保护记录
* 参数个数：0
* 函数参数：
* 返 回 值：
*           读取到的数据长度，为0读取不成功
* 修改记录：
*===============================================================
* 日期               修改人     修改内容
* 2018-06-22         戴辉发     创建
*2020/6/4             李勇      修改
==============================================================*/
uint8_t read_first_protect_record(void);

/*=============================================================
* 函数名称：read_next_protect_record
* 函数功能：读取下一条系统保护记录
* 参数个数：0
* 函数参数：
* 返 回 值：
*           读取到的数据长度，为0读取不成功
* 修改记录：
*===============================================================
* 日期               修改人     修改内容
*2020/6/4             李勇      修改
==============================================================*/
uint8_t read_next_protect_record(void);
/*=============================================================
* 函数名称：write_run_record_delay
* 函数功能：
* 参数个数：0
* 函数参数：
* 返 回 值：
*           
* 修改记录：
*===============================================================
* 日期               修改人     修改内容
*2020/11/25          李勇      修改
==============================================================*/
void write_run_record_delay(void);
/*=============================================================
* 函数名称：protect_record_clear
* 函数功能：清除所有系统保护记录
* 参数个数：0
* 函数参数：
* 返 回 值：
*           
* 修改记录：
*===============================================================
* 日期               修改人     修改内容
*2020/6/18             李勇      修改
==============================================================*/
void run_record_clear(void);
/*=============================================================
* 函数名称：protect_record_clear
* 函数功能：清除所有系统保护记录
* 参数个数：0
* 函数参数：
* 返 回 值：
*           
* 修改记录：
*===============================================================
* 日期               修改人     修改内容
*2020/6/18             李勇      修改
==============================================================*/
void protect_record_clear(void);
#endif

