#ifndef _SERIAL_NO_DEFINE_
#define _SERIAL_NO_DEFINE_

#include <stdint.h>

#define MAX_SERIAL_NO_LENGTH                       (30)

/* 产品系列号结构 */
typedef struct _T_SERIAL_NUMBER_STRUCT_
{
	uint8_t serial_no[MAX_SERIAL_NO_LENGTH];  /* 产品序列号 */
    uint8_t battery_no[MAX_SERIAL_NO_LENGTH]; /* 电池序列号 */
	uint8_t written_flag; /* 写入标志 */
}t_serial_number_st;

/* 硬件版本号结构 */
typedef struct 
{
    uint8_t no[24]; /* 硬件版本号 */
	uint8_t writtenFlag;           /* 写入标志 */
}HARDWARE_VERSION_NO;

extern t_serial_number_st g_serial_no;
extern HARDWARE_VERSION_NO hardwareVersionNo;
/*=============================================================
* 函数名称：serial_no_mem_init
* 函数功能：产品系列号管理模块内存初始化
* 参数个数：0
* 参数描述：
* 
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-06-22       	戴辉发     	创建
==============================================================*/
void serial_no_mem_init(void);

/*=============================================================
* 函数名称：serial_no_hard_init
* 函数功能：产品系列号管理模块硬件初始化
* 参数个数：0
* 参数描述：
* 
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期           修改人      修改类型
* 2018-06-22       	 戴辉发     	创建
==============================================================*/
void serial_no_hard_init(void);

/*=============================================================
* 函数名称：get_serial_no
* 函数功能：获取产品系列号
* 参数个数：1
* 参数描述：
*           [IN/OUT] buff         读取序列号内容存放缓冲
* 返 回 值：
*           0        未读取到
*           >0       读取到产品序列号长度
* 修改记录：
*===============================================================
* 日    期           修改人       修改类型
* 2018-06-22       	 戴辉发       创建
==============================================================*/
uint8_t get_serial_no(uint8_t *buff);

/*=============================================================
* 函数名称：set_serial_no
* 函数功能：设置产品系列号
* 参数个数：1
* 参数描述：
*           [IN/OUT] buff         读取序列号内容存放缓冲
* 返 回 值：
*           0        未读取到
*           >0       读取到产品序列号长度
* 修改记录：
*===============================================================
* 日    期           修改人       修改类型
* 2018-06-22       	 戴辉发       创建
==============================================================*/
void set_serial_no(uint8_t *buff);

/*=============================================================
* 函数名称：write_serial_no_to_eeprom
* 函数功能：写产品系列号到EEPROM
* 参数个数：0
* 参数描述：
* 返 回 值：无
*           
* 修改记录：
*===============================================================
* 日    期           修改人       修改类型
* 2018-10-17       	 戴辉发       创建
==============================================================*/
void write_serial_no_to_eeprom(void);
/*=============================================================
* 函数名称：WriteHardwareVersionNoToEeprom
* 函数功能：写硬件版本号到EEPROM
* 参数个数：0
* 参数描述：
* 返 回 值：无
*           
* 修改记录：
*===============================================================
* 日    期           修改人       修改类型
* 2023-07-06       	 liyong     	创建
==============================================================*/
void WriteHardwareVersionNoToEeprom(void);
/*=============================================================
* 函数名称：HardwareVersionNoInit
* 函数功能：硬件版本号硬件初始化
* 参数个数：0
* 参数描述：
* 
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期           修改人      修改类型
* 2023-07-06       	 liyong     	创建
==============================================================*/
void HardwareVersionNoInit(void);
#endif
