/*---------------------------------------------------------*
 * Copyright (C) 2018 杭州优恩捷科技有限公司。版权所有。
 *
 * 文件名：short.c
 * 文件功能描述：短路管理模块
 *
 * 修改记录：
 * 2018-06-28 戴辉发 创建
*----------------------------------------------------------*/
#ifndef _SHORT_DEFINE_
#define _SHORT_DEFINE_

#include <stdint.h>

/*=============================================================
 * 函数名称：short_mem_init
 * 函数功能：短路管理模块内存初始化
 * 参数个数：0
 * 函数参数：
 * 返回值：  
 *           无
 * 修改记录：
 *===============================================================
 * 日期                修改人             修改内容
 * 2018-06-28          戴辉发             创建
==============================================================*/
void short_mem_init(void);

/*=============================================================
 * 函数名称：get_short_status
 * 函数功能：获取当前短路状态
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *           短路状态, 0:无短路, 1:有短路
 * 修改记录：
 *===============================================================
 * 日期                修改人             修改内容
 * 2018-06-28          戴辉发             创建
==============================================================*/
uint8_t get_short_status(void);

/*=============================================================
 * 函数名称：set_short_status
 * 函数功能：获取当前短路状态
 * 参数个数：1
 * 函数参数：
 *           [IN]      short_status       短路状态, 0:无短路, 1:有短路
 * 返 回 值：
 *           
 * 修改记录：
 *===============================================================
 * 日期                修改人             修改内容
 * 2018-06-28          戴辉发             创建
==============================================================*/
void set_short_status(uint8_t short_status);

#endif
