#ifndef _SOC_DEFINE_
#define _SOC_DEFINE_

#include <stdint.h>

#define   DCH_CIRCLE_RVSD_NUM       (0x03)
#define   MAXIMUM_CYCLES          (1500)
#define   SINGLE_CYCLE_GAIN       (0.8)  
#define   FULL_CAPCITY            (SINGLE_CYCLE_GAIN*AH_VALUE * AH_RECORD)

/*---------------------------------------------------------*
电量标识
  ⑴满电量
  ⑵高电量
  ⑶智能补电门限电量
  ⑷正常电量
  ⑸低电量
  ⑹低电量黄色告警
  ⑺低电量红色告警
  ⑻告警电量
*----------------------------------------------------------*/
typedef enum E_SOC_FLAG_TYPE
{
	E_FULL_SOC, 
	E_HIGH_SOC, 
	E_SMART_CHARGE_LEVEL_SOC, 
	E_COMMON_SOC, 
    E_SUB_LOW_SOC,
	E_LOW_SOC,
	E_PROTECT_SOC,
}e_soc_flag_type;




/*=============================================================
* 函数名称：soc_manage_mem_init
* 函数功能：soc管理模块内存初始化
* 参数个数：0
* 参数描述：
* 
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-07-06       	戴辉发     	创建
==============================================================*/
void soc_manage_mem_init(void);

/*=============================================================
 * 函数名称：soc_manage_wakeup_mem_init
 * 函数功能：soc管理模块唤醒内存初始化
 * 参数个数：0
 * 参数描述：
 * 
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期          修改人      修改类型
 * 2020-02-21       	戴辉发     	创建
==============================================================*/
void soc_manage_wakeup_mem_init(void);

/*=============================================================
* 函数名称：get_residue_capcity
* 函数功能：获取当前剩余容量
* 参数个数：0
* 参数描述：
* 
* 返 回 值：
*           当前剩余容量，单位AH
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-07-06       	戴辉发     	创建
==============================================================*/
uint16_t get_residue_capcity(void);

/*=============================================================
* 函数名称：set_soc_count
* 函数功能：每秒钟设置一次
* 参数个数：0
* 参数描述：
* 
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-07-06       	戴辉发     	创建
==============================================================*/
void set_soc_count(void);

/*=============================================================
* 函数名称：set_soc_current_ad_value
* 函数功能：设置电流AD值
* 参数个数：1
* 参数描述：
*           [IN]    ad_value    AD值
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-07-06       	戴辉发     	创建
==============================================================*/
void set_soc_current_ad_value(int16_t ad_value);

/*=============================================================
* 函数名称：write_charge_num
* 函数功能：写充电次数
* 参数个数：0
* 参数描述：
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期           修改人       修改类型
* 2018-10-15       	 戴辉发       创建
==============================================================*/
void write_dch_circle_num(void);

/*=============================================================
* 函数名称：write_charge_num
* 函数功能：写充电次数
* 参数个数：0
* 参数描述：
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期           修改人       修改类型
* 2018-10-15       	 戴辉发       创建
==============================================================*/
void write_charge_num(void);

/*=============================================================
* 函数名称：write_ch_dch_num_to_eeprom
* 函数功能：写充放电次数到EEPROM
* 参数个数：0
* 参数描述：
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期           修改人       修改类型
* 2018-10-17       	 戴辉发       创建
==============================================================*/
void write_ch_dch_num_to_eeprom(void);

/*=============================================================
* 函数名称：update_cur_soc
* 函数功能：静态电池容量校准
* 参数个数：0
* 参数描述：
* 
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-09-14       	戴辉发     	创建
==============================================================*/
void update_cur_soc(void);

/*=============================================================
* 函数名称：default_capacity_adjust
* 函数功能：缺省静态电池容量校准
* 参数个数：0
* 参数描述：
* 
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-12-9       	戴辉发     	创建
==============================================================*/
void default_capacity_adjust(void);

void soc_manage_init(void);

void bat_capacity_adjust(void);

/*=============================================================
* 函数名称：s_timer_s_run
* 函数功能：SOC定时器1S
* 参数个数：0
* 参数描述：
* 
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-06-14       	戴辉发     	创建
==============================================================*/
void s_timer_s_run(void);

/*=============================================================
* 函数名称：get_soc_status
* 函数功能：获取剩余电量状态
* 参数个数：0
* 参数描述：
* 
* 返 回 值：
*           当前剩余电量状态
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-06-28       	戴辉发     	创建
==============================================================*/
e_soc_flag_type get_soc_status(void);

/*=============================================================
* 函数名称：get_soc_value
* 函数功能：获取SOC
* 参数个数：0
* 参数描述：
* 
* 返 回 值：
*           当前剩余电量状态
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-06-28       	戴辉发     	创建
==============================================================*/
uint8_t get_soc_value(void);

#if 0
/*=============================================================
 * 函数名称：get_soc_curr
 * 函数功能：获取10秒之内平均电流
 * 参数个数：0
 * 参数描述：
 *          [IN]     current    当前电流
 * 返 回 值：
 *          10秒之内平均电流
 * 修改记录：
 *==============================================================
 * 日    期          修改人      修改类型
 * 2020-02-17        戴辉发     	创建
==============================================================*/
int16_t get_soc_curr(void);
#endif

void soc_manage(void);

/*=============================================================
* 函数名称：soc_adjust_process
* 函数功能：SOC纠正过程
* 参数个数：0
* 参数描述：
* 
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-08-02       	戴辉发     	创建
==============================================================*/
void soc_adjust_process(void);

/*=============================================================
* 函数名称：get_total_capcity
* 函数功能：获取当前总容量
* 参数个数：0
* 参数描述：
* 
* 返 回 值：当前总容量，单位10mA/S
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-10-15       	戴辉发     	创建
==============================================================*/
uint32_t get_total_capcity(void);

/*=============================================================
* 函数名称：set_total_capcity
* 函数功能：设置当前总容量
* 参数个数：1
* 参数描述：
*           [IN]    total       容量值，单位10mA/S
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-10-15       	戴辉发     	创建
==============================================================*/
void set_total_capcity(uint32_t total);

/*=============================================================
* 函数名称：get_soc_current
* 函数功能：获取SOC电流
* 参数个数：0
* 参数描述：
* 返 回 值：
*           返回SOC上一秒电流
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-10-15       	戴辉发     	创建
==============================================================*/
int16_t get_soc_current(void);

/*=============================================================
* 函数名称：set_soc_adjust_flag
* 函数功能：设置SOC校准标志
* 参数个数：0
* 参数描述：
* 返 回 值：
*           返回SOC上一秒电流
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-10-16       	戴辉发     	创建
==============================================================*/
void set_soc_adjust_flag(void);

/*=============================================================
* 函数名称：force_set_soc
* 函数功能：强制设定SOC值，需要根据温度调整当前分母部分，主要指总容量
* 参数个数：2
* 参数描述：
*          [IN]     soc         将要设定的 SOC值，
*          [IN]     flag        向上向下判决，
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人       修改类型
* 2019-01-18       	戴辉发     	创建
==============================================================*/
void force_set_soc(uint16_t soc, uint8_t flag);

/*=============================================================
 * 函数名称：set_over_vol_num
 * 函数功能：设置过压次数
 * 参数个数：0
 * 参数描述：
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期          修改人       修改类型
 * 2019-11-18        戴辉发       创建
==============================================================*/
void set_over_vol_num(void);

/*=============================================================
 * 函数名称：set_low_vol_num
 * 函数功能：设置欠压次数
 * 参数个数：0
 * 参数描述：
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期          修改人       修改类型
 * 2019-11-18        戴辉发       创建
==============================================================*/
void set_low_vol_num(void);

/*=============================================================
 * 函数名称：set_ch_ov_curr_num
 * 函数功能：设置充电过流次数
 * 参数个数：0
 * 参数描述：
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期          修改人       修改类型
 * 2019-11-18        戴辉发       创建
==============================================================*/
void set_ch_ov_curr_num(void);

/*=============================================================
 * 函数名称：set_dch_over_curr_num
 * 函数功能：设置放电过流次数
 * 参数个数：0
 * 参数描述：
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期          修改人       修改类型
 * 2019-11-18        戴辉发       创建
==============================================================*/
void set_dch_over_curr_num(void);

/*=============================================================
 * 函数名称：set_ch_ov_temp_num
 * 函数功能：设置充电过温次数
 * 参数个数：0
 * 参数描述：
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期          修改人       修改类型
 * 2019-11-18        戴辉发       创建
==============================================================*/
void set_ch_ov_temp_num(void);

/*=============================================================
 * 函数名称：set_dch_ov_temp_num
 * 函数功能：设置放电过温次数
 * 参数个数：0
 * 参数描述：
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期          修改人       修改类型
 * 2019-11-18        戴辉发       创建
==============================================================*/
void set_dch_ov_temp_num(void);

/*=============================================================
 * 函数名称：set_afe_error_num
 * 函数功能：设置AFE错误计数
 * 参数个数：0
 * 参数描述：
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期          修改人       修改类型
 * 2019-11-18        戴辉发       创建
==============================================================*/
void set_afe_error_num(void);

/*=============================================================
 * 函数名称：GetCarLoadRecivedFlag
 * 函数功能：获取 carLoadRecivedFlag 标志
 * 参数个数：0
 * 参数描述：
 * 
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期          修改人      修改类型
 * 2022-03-31        liyong     	创建
==============================================================*/
uint8_t GetCarLoadRecivedFlag(void);
/*=============================================================
 * 函数名称：SetCarLoadRecivedFlag
 * 函数功能：收到整车指令，就设置为1
 * 参数个数：0
 * 参数描述：
 * 
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期          修改人      修改类型
 * 2022-03-31        liyong     	创建
==============================================================*/
void SetCarLoadRecivedFlag(uint8_t flag);

/*=============================================================
 * 函数名称：SetFullSocFlag
 * 函数功能：设置SOC置百标志
             0: SOC可置零
             1：正常更新SOC
             2：SOC可置百
 * 参数描述：无
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期          修改人       修改类型
 * 2024-03-11        Fanyl       创建
==============================================================*/
void SetFullSocFlag(uint8_t ret);

/*=============================================================
 * 函数名称：GetFullSocFlag
 * 函数功能：设置SOC置百标志
 * 参数描述：无
 * 返 回 值：0: SOC可置零
             1：正常更新SOC
             2：SOC可置百
 * 修改记录：
 *===============================================================
 * 日    期          修改人       修改类型
 * 2024-03-11        Fanyl       创建
==============================================================*/
uint8_t GetFullSocFlag(void);
#endif

