/*---------------------------------------------------------*
* Copyright (C) 2018 杭州优恩捷科技有限公司。版权所有。
*
* 文件名：soc_update.h
* 文件功能描述：实现SOC容量更新
*
* 修改记录：
* 2018-10-15 戴辉发 创建
*----------------------------------------------------------*/

#ifndef _SOC_UPDATE_DEFINE_
#define _SOC_UPDATE_DEFINE_

#include <stdint.h>

/*=============================================================
 * 函数名称：soc_update_mem_init
 * 函数功能：容量更新模块内存初始化
 * 参数个数：0
 * 参数描述：
 * 
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期          修改人      修改类型
 * 2018-10-15        戴辉发     	创建
==============================================================*/
void soc_update_mem_init(void);

/*=============================================================
 * 函数名称：soc_update_mem_init
 * 函数功能：容量更新模块内存初始化
 * 参数个数：0
 * 参数描述：
 * 
 * 返 回 值：
 *          
 * 修改记录：
 *==============================================================
 * 日    期          修改人      修改类型
 * 2018-02-24        戴辉发      创建
==============================================================*/
uint32_t get_real_capcity(void);

/*=============================================================
 * 函数名称：soc_update_hard_init
 * 函数功能：SOC更新硬件初始化
 * 参数个数：0
 * 参数描述：
 * 
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期           修改人      修改类型
 * 2018-10-16         戴辉发     	创建
==============================================================*/
void soc_update_hard_init(void);

/*=============================================================
 * 函数名称：soc_update_dch_capcity
 * 函数功能：SOC更新模块电流积分
 * 参数个数：1
 * 函数参数：
 *           [IN]      current            电流，只在放电时有效
 * 返回值：  
 *           无
 * 修改记录：
 *===============================================================
 * 日期                修改人             修改内容
 * 2020-02-23          戴辉发             创建
==============================================================*/
void soc_update_dch_capcity(int16_t current);

/*=============================================================
 * 函数名称：soc_update_dch_capcity_statrt
 * 函数功能：启动SOC更新模块电流积分
 * 参数个数：0
 * 函数参数：
 * 返回值：  
 *          无
 * 修改记录：
 *===============================================================
 * 日期                修改人             修改内容
 * 2020-02-23          戴辉发             创建
==============================================================*/
void soc_update_dch_capcity_statrt(void);

/*=============================================================
 * 函数名称：soc_update_dch_capcity_end
 * 函数功能：完成SOC更新模块电流积分
 * 参数个数：1
 * 函数参数：
 * 返回值：  
 *          无
 * 修改记录：
 *===============================================================
 * 日期                修改人             修改内容
 * 2020-02-23          戴辉发             创建
==============================================================*/
void soc_update_dch_capcity_end(void);

/*=============================================================
 * 函数名称：soc_update_dch_capcity_stop
 * 函数功能：停止SOC更新模块电流积分
 * 参数个数：1
 * 函数参数：
 * 返回值：  
 *          无
 * 修改记录：
 *===============================================================
 * 日期                修改人             修改内容
 * 2020-02-23          戴辉发             创建
==============================================================*/
void soc_update_dch_capcity_stop(void);

/*=============================================================
 * 函数名称：soc_update_capcity_config
 * 函数功能：参数配置的容量更新
 * 参数个数：0
 * 函数参数：
 * 返回值：  
 *          无
 * 修改记录：
 *===============================================================
 * 日期                修改人             修改内容
 * 2020-02-24          戴辉发             创建
==============================================================*/
void soc_update_capcity_config(void);

/*=============================================================
 * 函数名称：write_capcity_para
 * 函数功能：写充放电循环等参数
 * 参数个数：0
 * 参数描述：
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期           修改人       修改类型
 * 2018-07-06         戴辉发       创建
==============================================================*/
void write_capcity_para(void);
/*=============================================================
 * 函数名称：capacity_data_clear
 * 函数功能：容量累计次数复位
 * 参数个数：0
 * 参数描述：
 * 
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期           修改人      修改类型
 * 2020-10-13         liyong      创建
==============================================================*/
void capacity_data_clear(void);
#endif
