/*---------------------------------------------------------*
* Copyright (C) 2018 杭州优恩捷科技有限公司。版权所有。
*
* 文件名：switch_status.c
* 文件功能描述：实现开关状态管理
*
* 修改记录：
* 2018-06-25 戴辉发 创建
*----------------------------------------------------------*/

#ifndef _SWITCH_STATUS_DEFINE_
#define _SWITCH_STATUS_DEFINE_

#include <stdint.h>

typedef enum E_MOS_OPERATE_STATUS
{
    E_OFF_STATUS, 
    E_ON_STATUS, 
}e_mos_operate_status;

typedef enum E_SWITCH_FLAG_TYPE
{
	E_SWITCH_INVALID, /* 开关失效 */
	E_SWITCH_VALID /* 开关正常*/
}e_switch_switch_type;

#define SWITCH_IN_INVALID(a)                        (a == E_SWITCH_INVALID)

#define   SPEAKER_RELAY_DETECT_GPIO        GPIOA
#define   SPEAKER_RELAY_DETECT_GPIO_PIN    FL_GPIO_PIN_1

#define   SPEAKER_RELAY_CONTROL_GPIO       GPIOA
#define   SPEAKER_RELAY_CONTROL_GPIO_PIN   FL_GPIO_PIN_0

#define   DISCHARGER_RELAY_ON_GPIO      GPIOB
#define   DISCHARGER_RELAY_ON_GPIO_PIN  FL_GPIO_PIN_0

#define   HEAT_RELAY_DETECT_GPIO        GPIOB
#define   HEAT_RELAY_DETECT_GPIO_PIN    FL_GPIO_PIN_1

#define   HEAT_RELAY_CONTROL_GPIO       GPIOB
#define   HEAT_RELAY_CONTROL_GPIO_PIN   FL_GPIO_PIN_2

#define   PRECHARGER_RELAY_GPIO         GPIOB
#define   PRECHARGER_RELAY_GPIO_PIN     FL_GPIO_PIN_5

#define   DRY_RELAY_GPIO                GPIOB
#define   DRY_RELAY_GPIO_PIN            FL_GPIO_PIN_3

#define   CHARGER_RELAY_GPIO            GPIOB
#define   CHARGER_RELAY_GPIO_PIN        FL_GPIO_PIN_6

#define   DISCHARGER_RELAY_GPIO         GPIOB
#define   DISCHARGER_RELAY_GPIO_PIN     FL_GPIO_PIN_7

/*=============================================================
 * 函数名称：switch_status_innermem_init
 * 函数功能：开关状态内存初始化
 * 参数个数：0
 * 函数参数：
 * 返 回 值：   
 * 修改记录:
 *==============================================================
 * 日期                修改人             修改内容
 * 2020-02-21          戴辉发             创建
==============================================================*/
void switch_status_innermem_init(void);

/*=============================================================
 * 函数名称：switch_status_mem_init
 * 函数功能：开关状态内存初始化
 * 参数个数：0
 * 函数参数：
 * 返 回 值：   
 * 修改记录:
 *==============================================================
 * 日期                修改人             修改内容
 * 2018-12-25          戴辉发             创建
==============================================================*/
void switch_status_mem_init(void);

/*=============================================================
 * 函数名称：switch_status_ms_process
 * 函数功能：开关状态定时器运行
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *           无
 * 修改记录：
 *==============================================================
 * 日期                修改人             修改内容
 * 2020-02-21          戴辉发             创建
==============================================================*/
void switch_status_ms_process(void);

/*=============================================================
 * 函数名称：get_ch_switch_flag
 * 函数功能：获取充电开关失效标识
 * 参数个数：0
 * 函数参数：
 * 返回值：     
 *          0          正常
 *          1          失效
 * 修改记录:
 *===============================================================
 * 日期                修改人             修改内容
 * 2018-12-25          戴辉发             创建
==============================================================*/
e_switch_switch_type get_ch_switch_flag(void);

/*=============================================================
 * 函数名称：get_dch_switch_flag
 * 函数功能：获取放电开关失效标识
 * 参数个数：0
 * 函数参数：
 * 返回值：     
 *          0          开关正常
 *          1          开关失效
 * 修改记录:
 *===============================================================
 * 日期                修改人             修改内容
 * 2018-12-25          戴辉发             创建
==============================================================*/
e_switch_switch_type get_dch_switch_flag(void);

/*=============================================================
 * 函数名称：dch_disconnect_request
 * 函数功能：放电保护断开请求
 * 参数个数：0
 * 参数描述：
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期          修改人       修改类型
 * 2019-05-24        戴辉发       创建
==============================================================*/
void dch_disconnect_request(void);

/*=============================================================
 * 函数名称：dch_connect_request
 * 函数功能：放电请求连接
 * 参数个数：0
 * 参数描述：
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期          修改人       修改类型
 * 2019-05-24        戴辉发       创建
==============================================================*/
void dch_connect_request(void);

/*=============================================================
 * 函数名称：ch_disconnect_request
 * 函数功能：充电保护断开请求
 * 参数个数：0
 * 参数描述：
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期          修改人       修改类型
 * 2019-05-24        戴辉发       创建
==============================================================*/
void ch_disconnect_request(void);

/*=============================================================
 * 函数名称：ch_connect_request
 * 函数功能：充电请求连接
 * 参数个数：0
 * 参数描述：
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期          修改人       修改类型
 * 2019-05-24        戴辉发       创建
==============================================================*/
void ch_connect_request(void);

/*=============================================================
 * 函数名称：switch_operate_process
 * 函数功能：开关操作流程
 * 参数个数：0
 * 参数描述：
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期             修改人      修改类型
 * 2018-01-17       	戴辉发     	创建
==============================================================*/
void switch_operate_process(void);

/*=============================================================
 * 函数名称：final_set_switch
 * 函数功能：终极保护设置开关状态
 * 参数个数：1
 *          [IN]     flag         终极保护开关标志，0：无终极保护，1：终极保护
 * 参数描述：
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期          修改人       修改类型
 * 2018-01-17        戴辉发       创建
==============================================================*/
void final_set_switch(uint16_t flag);
/*=============================================================
 * 函数名称：get_final_set_switch
 * 函数功能：获取终极保护设置开关状态
 * 参数个数：0
 *         
 * 参数描述：
 * 返 回 值：终极保护开关标志
 * 修改记录：
 *===============================================================
 * 日    期          修改人       修改类型
 * 2018-01-17        戴辉发       创建
==============================================================*/
uint16_t get_final_set_switch(void);
/*=============================================================
 * 函数名称：switch_fault_process
 * 函数功能：开关失效判决流程
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *          无
 * 修改记录：
 *==============================================================
 * 日期                修改人             修改内容
 * 2018-06-27          戴辉发             创建
==============================================================*/
void switch_fault_process(void);


/*=============================================================
 * 函数名称：wakeup_init_switch_status
 * 函数功能：开关状态内存初始化
 * 参数个数：0
 * 函数参数：
 * 返 回 值：   
 * 修改记录:
 *==============================================================
 * 日期                修改人             修改内容
 * 2020-06-08          liyong             创建
==============================================================*/
void wakeup_init_switch_status();
   
/*=============================================================
 * 函数名称：get_status_error_flag
 * 函数功能：获取状态互斥标志位
 * 参数个数：0
 *         
 * 参数描述：
 * 返 回 值：终极保护开关标志
 * 修改记录：
 *===============================================================
 * 日    期          修改人       修改类型
 * 2020-6-9          李勇        创建
==============================================================*/
uint8_t get_status_error_flag(void);
/*=============================================================
 * 函数名称：cutoff_all_switch
 * 函数功能：关闭所有的mos管
 * 参数个数：1
 * 参数描述：
 *           无
 * 返 回 值：
 *           无
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-08-20        liyong      创建
==============================================================*/
void cutoff_all_switch(void);
/*=============================================================
 * 函数名称：get_ch_switch_status
 * 函数功能：获取充电MOS状态
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 *           0       充电MOS断开
 *           1       充电MOS闭合
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-05-08        戴辉发      创建
==============================================================*/
uint8_t get_ch_switch_status(void);
/*=============================================================
 * 函数名称：get_dch_switch_status
 * 函数功能：获取放电MOS状态
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 *           0       放电MOS断开
 *           1       放电MOS闭合
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-05-08        戴辉发      创建
==============================================================*/
uint8_t get_dch_switch_status(void);
/*=============================================================
 * 函数名称：heat_switch_detect
 * 函数功能：加热检测
 * 参数个数：0
 *         
 * 参数描述：
 * 返 回 值：
 * 修改记录：
 *===============================================================
 * 日    期          修改人       修改类型
 * 2021-11-19         李勇         创建
==============================================================*/
uint8_t heat_switch_detect( void );
/*=============================================================
 * 函数名称：DryOut2ControlOperate
 * 函数功能：操作DryOut2
 * 参数个数：
 *         
 * 参数描述：
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期          修改人       修改类型
 * 2021-01-21         liyong       创建
==============================================================*/
void SpeakerControlOperate( e_mos_operate_status status );

/*=============================================================
 * 函数名称：DryOut2ControlOperate
 * 函数功能：操作DryOut2
 * 参数个数：
 *         
 * 参数描述：
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期          修改人       修改类型
 * 2021-01-21         liyong       创建
==============================================================*/
void DryOut2ControlOperate( e_mos_operate_status status );
/*=============================================================
 * 函数名称：DryOut1ControlOperate
 * 函数功能：操作DryOut1
 * 参数个数：
 *         
 * 参数描述：
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期          修改人       修改类型
 * 2021-01-21         liyong       创建
==============================================================*/
void DryOut1ControlOperate( e_mos_operate_status status );
/*=============================================================
 * 函数名称：OdControlOperate
 * 函数功能：操作od 
 * 参数个数：
 *         
 * 参数描述：
 * 返 回 值：无
 * 修改记录：
 *===============================================================
 * 日    期          修改人       修改类型
 * 2021-01-21         liyong       创建
==============================================================*/
void OdControlOperate( e_mos_operate_status status );
/*=============================================================
 * 函数名称：SpeakerControlExist
 * 函数功能：Speaker检查存在与否
 * 参数个数：
 *         
 * 参数描述：
 * 返 回 值：
             0：不存在
             1：存在
             2：无效
 * 修改记录：
 *===============================================================
 * 日    期          修改人       修改类型
 * 2021-01-21         liyong       创建
==============================================================*/
uint8_t SpeakerControlExist(void);

/*=============================================================
 * 函数名称：heat_on
 * 函数功能：加热打开
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *           无
 * 修改记录:
 *===============================================================
 * 日期                修改人             修改内容
 * 2020-01-13          李勇          创建
==============================================================*/
void heat_on(void);

/*=============================================================
 * 函数名称：judge_heat_on
 * 函数功能：判断加热是否打开
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *           0         未打开
 *           1         打开加热系统
 * 修改记录:
 *===============================================================
 * 日期                修改人             修改内容
 * 2021-10-09          李勇          创建
==============================================================*/
uint8_t judge_heat_on(void);

/*=============================================================
 * 函数名称：heat_off
 * 函数功能：加热关闭
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *           无
 * 修改记录:
 *===============================================================
 * 日期                修改人             修改内容
 * 2020-01-13          李勇          创建
==============================================================*/
void heat_off(void);

extern e_mos_operate_status g_ch_mos_status;
extern e_mos_operate_status g_dch_mos_status;
extern e_mos_operate_status g_heat_relay_status;

#endif

