/*---------------------------------------------------------*
* Copyright (C) 2017 艾启新能源有限公司。版权所有。
*
* 文件名：system_control.h
* 文件功能描述：实现电池模块系统控制
*
* 修改记录：
* 2017-03-27 戴辉发 创建
*----------------------------------------------------------*/
#ifndef _SYSTEM_CONTROL_DEFINE_
#define _SYSTEM_CONTROL_DEFINE_

#include <stdint.h>

/* 最外层状态类型定义 */
typedef enum E_SYSTEM_GRANDFATHER_STATUS
{
	E_DISABLE_STATUS, 
	E_ENABLE_STATUS, 
	E_GRAND_MAX_STATUS_NUM 
}e_system_grandfather_status;

/* 父状态类型定义 */
typedef enum E_SYSTEM_STATUS
{
	E_IDLE_STATUS, 
	E_CHARGE_STATUS, 
	E_DISCHARGE_STATUS, 
	E_ABATE_STATUS, 
	E_MAX_STATUS_NUM 
}e_system_status;

/*=============================================================
* 函数名称：control_mem_init
* 函数功能：业务控制模块内存初始化
* 参数个数：0
* 函数参数：
* 返回值：  
*           无
* 修改记录：
*===============================================================
* 日期                修改人             修改内容
* 2017-03-28          戴辉发             创建
==============================================================*/
void control_mem_init(void);
/*=============================================================
 * 函数名称：control_wake_mem_init
 * 函数功能：业务控制休眠唤醒内存初始化
 * 参数个数：0
 * 函数参数：
 * 返回值：  
 *           无
 * 修改记录：
 *===============================================================
 * 日期                修改人             修改内容
 * 2018-06-25          戴辉发             创建
==============================================================*/
void control_wake_mem_init(void);

/*=============================================================
* 函数名称：control_mem_init
* 函数功能：业务控制模块内存初始化
* 参数个数：0
* 函数参数：
* 返回值：  
*           无
* 修改记录：
*===============================================================
* 日期                修改人             修改内容
* 2018-06-25          戴辉发             创建
==============================================================*/
void control_timer_run(void);

/*=============================================================
* 函数名称：control_hard_init
* 函数功能：业务控制模块硬件初始化
* 参数个数：0
* 函数参数：
* 返回值：  
*           无
* 修改记录：
*===============================================================
* 日期                修改人             修改内容
* 2017-05-26          戴辉发             创建
==============================================================*/
void control_hard_init(void);

/*=============================================================
* 函数名称：control_enable_request
* 参数个数：1
* 函数参数：
*           [IN]      enabled_flag       模块使能标识，0禁止,1激活
* 返回值：  
*           无
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2017-03-28          戴辉发             创建
==============================================================*/
void control_enable_request(uint32_t enabled_flag);

/*=============================================================
* 函数名称：control_source_indication
* 参数个数：0
* 函数参数：
* 返回值：  
*           无
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2017-03-28          戴辉发             创建
==============================================================*/
void control_source_indication(void);

/*=============================================================
* 函数名称：control_current_indication
* 参数个数：0
* 函数参数：
* 返回值：  
*           无
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2017-03-28          戴辉发             创建
==============================================================*/
void control_current_indication(void);

/*=============================================================
* 函数名称：control_voltage_indication
* 参数个数：0
* 函数参数：
* 返回值：  
*           无
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2017-03-28          戴辉发             创建
==============================================================*/
void control_voltage_indication(void);

/*=============================================================
* 函数名称：control_temp_indication
* 参数个数：0
* 函数参数：
*           
* 返回值：  
*           无
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2018-06-25          戴辉发             创建
==============================================================*/
void control_temp_indication(void);

/*=============================================================
* 函数名称：control_notify_indication
* 参数个数：0
* 函数参数：
*           
* 返回值：  
*           无
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2018-06-25          戴辉发             创建
==============================================================*/
void control_notify_indication(void);

/*=============================================================
* 函数名称：control_AFE_indication
* 参数个数：0
* 函数参数：
* 返回值：  
*           无
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2017-03-28          戴辉发             创建
==============================================================*/
void control_AFE_indication(void);

/*=============================================================
* 函数名称：control_final_indication
* 参数个数：0
* 函数参数：
* 返回值：  
*           无
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2017-03-28          戴辉发             创建
==============================================================*/
void control_final_indication(void);

/*=============================================================
* 函数名称：get_system_status
* 参数功能：获取当前系统状态
* 参数个数：0
* 函数参数：
*           
* 返 回 值：
*           返回系统状态
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2018-06-28          戴辉发             创建
==============================================================*/
e_system_status get_system_status(void);

/*=============================================================
* 函数名称：get_switch_msg
* 函数功能：获取开关量事件
* 参数个数：0
* 函数参数：
* 返 回 值：
*           返回开关量事件代码
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2017-06-01          戴辉发             创建
==============================================================*/
uint8_t get_switch_msg(void);

/*=============================================================
* 函数名称：get_other_msg
* 函数功能：获取其他事件
* 参数个数：0
* 函数参数：
* 返 回 值：
*           返回其他事件代码
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2017-06-01          戴辉发             创建
==============================================================*/
uint8_t get_other_msg(void);

/*=============================================================
* 函数名称：get_system_code
* 函数功能：获取系统代码
* 参数个数：0
* 函数参数：
* 返 回 值：
*           返回系统代码
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2017-06-01          戴辉发             创建
==============================================================*/
uint8_t get_system_code(void);

/*=============================================================
 * 函数名称：get_cutoff_flag
 * 函数功能：获取是否需要关闭放电，用于设置充电标志;
 * 参数描述：无
 * 返 回 值：是否需要关闭放电
 * 修改记录:
 *===============================================================
 * 日期                修改人             修改内容
 * 2021-03-30          liyong             创建
==============================================================*/
uint8_t get_cutoff_flag(void);

void discharge_off(void);
void charge_off(void);
/*******************************************************************************
**FuncName: get_g_grand_status;//
**Function: 获取控制模块状态;
**Output  : 1;
**input   : 无;
**Create date : liyong @2021.8.23
**Modify  : 
*******************************************************************************/
e_system_grandfather_status get_g_grand_status(void);
/*=============================================================
 * 函数名称：judge_heat_on
 * 函数功能：判断加热是否打开
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *           无
 * 修改记录:
 *===============================================================
 * 日期                修改人             修改内容
 * 2021-10-09          李勇          创建
==============================================================*/
uint8_t judge_heat_on(void);

uint8_t GetCellTempSpinFlag(void);

#endif

