#ifndef _SYSTEM_ADJUST_DEFINE_
#define _SYSTEM_ADJUST_DEFINE_

#include <stdint.h>

#define MAX_SOC_VALUE              (255)

/* 电流校准参数结构定义 */
typedef struct _ADJUST_PARA_STRUCT_
{
	float k_value; /* 电流校准K值 */
	float b_value; /* 电流校准B值 */
	uint8_t end_id;
}t_adjust_para_st;

extern t_adjust_para_st g_adjust_curr_para;
/* 校准电流，单位10mA */
extern short correct_curr;
/* 校准电压1，单位毫伏 */
extern uint16_t correct_vol1;
/* 校准电压2，单位毫伏 */
extern uint16_t correct_vol2;

extern uint16_t g_balance_test;

/*==============================================================
* 函数名称：system_adjust_mem_init
* 函数功能：系统参数内存初始化
* 参数个数：0
* 函数参数：
* 返 回 值：
*           无
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2018-06-22          戴辉发             创建
==============================================================*/
void system_adjust_mem_init(void);

/*==============================================================
* 函数名称：system_adjust_hard_init
* 函数功能：系统校准参数内存读取存储区后初始化
* 参数个数：0
* 函数参数：
* 返 回 值：
*           无
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2018-06-22          戴辉发             创建
==============================================================*/
void system_adjust_hard_init(void);

/*==============================================================
* 函数名称：save_adjust_current_parameter
* 函数功能：保存校准参数
* 参数个数：0
* 函数参数：
* 返 回 值：
*           无
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2018-06-22          戴辉发             创建
==============================================================*/
void save_adjust_current_parameter(void);

/*==============================================================
* 函数名称：get_current_kb_value
* 函数功能：获取电流KB值
* 参数个数：2
* 函数参数：
*           [IN]      k_value            零点电流值
*           [IN]      b_value            零点电流对应的adc值
* 返 回 值：
*           无
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2018-06-22          戴辉发             创建
==============================================================*/
void get_current_kb_value(float *k_value, float *b_value, float *vref, float *amplify);

/*==============================================================
* 函数名称：current_adjust
* 函数功能：电流校准过程
* 参数个数：0
* 函数参数：
* 返 回 值：
*           无
* 修改记录：
*===============================================================
* 日期                修改人             修改内容
* 2018-07-06          戴辉发             创建
==============================================================*/
void current_adjust(void);

/*==============================================================
* 函数名称：save_adjust_voltage_parameter
* 函数功能：保存电压校准参数
* 参数个数：0
* 函数参数：
* 返 回 值：
*           无
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2018-06-23          戴辉发             创建
==============================================================*/
void save_adjust_voltage_parameter(void);

/*==============================================================
* 函数名称：set_voltage_kb_value
* 函数功能：设定电压KB值
* 参数个数：3
* 函数参数：
*           [IN]      k_value            电流K值缓冲
*           [IN]      b_value            电流B值缓冲
*           [IN]      num                电芯个数
* 返 回 值：
*           无
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2018-06-23          戴辉发             创建
==============================================================*/
void set_voltage_kb_value(float *k_value, float *b_value, uint8_t num);

/*==============================================================
* 函数名称：get_voltage_kb_value
* 函数功能：获取指定电芯KB值
* 参数个数：3
* 函数参数：
*           [IN/OUT]  k_value            零点电流值
*           [IN/OUT]  b_value            零点电流对应的adc值
*           [IN]      index              电芯位置索引
* 返 回 值：
*           无
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2018-06-23          戴辉发             创建
==============================================================*/
void get_voltage_kb_value(float *k_value, float *b_value, uint8_t index);

/*==============================================================
* 函数名称：soc_static_adjust
* 函数功能：系统静态开路校准
* 参数个数：1
* 函数参数：
*           [IN]      voltage            输入电压值
*           [IN]      flag               校准标识
* 返 回 值：
*           SOC
* 修改记录:
*===============================================================
* 日期                修改人             修改内容
* 2018-07-06          戴辉发             创建
==============================================================*/
uint16_t soc_static_adjust(uint16_t voltage, uint8_t flag);

/*==============================================================
* 函数名称：voltage1_adjust
* 函数功能：电压1校准
* 参数个数：0
* 函数参数：
* 返 回 值：
*           无
* 修改记录：
*===============================================================
* 日期                修改人             修改内容
* 2018-07-06          戴辉发             创建
==============================================================*/
void voltage1_adjust(void);

/*==============================================================
* 函数名称：voltage2_adjust
* 函数功能：电压2校准
* 参数个数：0
* 函数参数：
* 返 回 值：
*           无
* 修改记录：
*===============================================================
* 日期                修改人             修改内容
* 2018-07-06          戴辉发             创建
==============================================================*/
void voltage2_adjust(void);

/*==============================================================
* 函数名称：balance_adjustt
* 函数功能：均衡测试
* 参数个数：0
* 函数参数：
* 返 回 值：
*           无
* 修改记录：
*===============================================================
* 日期                修改人             修改内容
* 2018-10-19          戴辉发             创建
==============================================================*/
void balance_adjust(void);

/*==============================================================
* 函数名称：voltage_kb_adjust
* 函数功能：电压斜率和基准计算
* 参数个数：0
* 函数参数：
* 返 回 值：
*           无
* 修改记录：
*===============================================================
* 日期                修改人             修改内容
* 2018-07-06          戴辉发             创建
==============================================================*/
void voltage_kb_adjust(void);

/*==============================================================
 * 函数名称：calaclute_voltage
 * 函数功能：根据ADC计算单体电压
 * 参数个数：2
 * 函数参数：
 *           [IN]      cell_index         对应单体电压下限
 *           [IN]      adc_value          采样换算后的电压值
 * 返 回 值：
 *           校准后电压值
 * 修改记录：
 *===============================================================
 * 日期                修改人             修改内容
 * 2018-07-06          戴辉发             创建
==============================================================*/
uint16_t calaclute_voltage(uint8_t cell_index, float adc_value);

/*==============================================================
 * 函数名称：calaclute_voltage
 * 函数功能：根据ADC计算单体电压
 * 参数个数：1
 * 函数参数：
 *           [IN]      adc_value          采样换算后的电压值
 * 返 回 值：
 *           校准后电压值
 * 修改记录：
 *===============================================================
 * 日期                修改人             修改内容
 * 2018-07-06          戴辉发             创建
==============================================================*/
uint16_t calaclute_total_voltage(uint16_t adc_value);
extern uint16_t g_break_test;
extern uint16_t g_software_reset;
extern uint16_t g_clear_protect;
extern uint16_t g_clear_fault;
extern uint16_t g_clear_voltage_Adjust;
extern uint16_t g_clear_current_Adjust;
extern uint16_t g_clear_limit;
extern uint32_t g_test_cmd;
void Break_detection_test(void);
void software_reset(void);
void clear_protect_numb(void);
void clear_fault_numb(void);
void clear_voltage_Adjust(void);
void clear_current_Adjust(void);
void clear_limit_vaule(void);
void test_bms_cmd(void);
#endif
