#ifndef _TEMPERATURE_MANAGE_DEFINE_
#define _TEMPERATURE_MANAGE_DEFINE_

#include <stdint.h>
#include "adc_sampling.h"

/* 单项温度状态 */
typedef enum _E_ITEM_STATUS_
{
	E_TEMP_LOW_PROTECT, /* 低温保护 */
	E_TEMP_LOW_ALARM, /* 低温告警 */
	E_TEMP_IDLE, /* 温度正常 */
	E_TEMP_HIGH_ALARM, /* 高温告警 */
	E_TEMP_HIGH_PROTECT, /* 高温保护 */
}e_item_status;

/* 温度状态 */
typedef enum _E_TEMP_STATUS_
{
	E_TEMP_IDLE_STATUS, /* 温度正常 */
	E_TEMP_ALARM_STATUS, /* 温度告警 */
	E_TEMP_DISCH_STATUS, /* 温度禁充 */
	E_TEMP_DISDCH_STATUS, /* 温度禁放 */
	E_TEMP_DISCHDCH_STATUS, /* 温度禁充放 */
}e_temp_status;

extern uint8_t g_report_cell_temp;

/*=============================================================
* 函数名称：t_timer_run
* 函数功能：温度逻辑模块S定时器
* 参数个数：0
* 参数描述：
* 
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-07-06       	戴辉发     	创建
==============================================================*/
void t_timer_run(void);

/*=============================================================
* 函数名称：temperature_init
* 函数功能：温度逻辑处理模块初始
* 参数个数：0
* 参数描述：
* 
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-06-14       	戴辉发     	创建
==============================================================*/
void temperature_init(void);

/*=============================================================
* 函数名称：get_temperature_status
* 函数功能：获取当前温度状态
* 参数个数：0
* 参数描述：
* 
* 返 回 值：
*           当前温度状态
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-06-27       	戴辉发     	创建
==============================================================*/
e_temp_status get_temperature_status(void);

/*=============================================================
* 函数名称：temperature_get_data
* 函数功能：温度逻辑处理模块温度采集温度模块
* 参数个数：2
* 参数描述：
*          [IN]     ad_value    AD值
*          [IN]     cur_temp    当前温度状态
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-06-14       	戴辉发     	创建
==============================================================*/
uint8_t temperature_get_data(int32_t ad_value, e_ad_ch_type *cur_temp);

/*=============================================================
* 函数名称：temperature_mange
* 函数功能：温度逻辑处理模块温度处理主流程
* 参数个数：0
* 参数描述：
* 
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-06-14       	戴辉发     	创建
==============================================================*/
void temperature_mange(void);

/*=============================================================
* 函数名称：get_ch_temp_status
* 函数功能：获取指定电芯充电温度状态
* 参数个数：0
* 参数描述：
* 返 回 值：
*           电芯充电温度状态
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-09-09       	戴辉发     	创建
==============================================================*/
e_item_status get_ch_temp_status(void);

/*=============================================================
* 函数名称：get_dch_temp_status
* 函数功能：获取指定电芯放电温度状态
* 参数个数：0
* 参数描述：
* 返 回 值：
*           电芯放电温度状态
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-09-09       	戴辉发     	创建
==============================================================*/
e_item_status get_dch_temp_status(void);

/*=============================================================
* 函数名称：get_environ_temp_status
* 函数功能：获取指定环境温度状态
* 参数个数：0
* 参数描述：
* 返 回 值：
*           环境温度状态
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-09-09       	戴辉发     	创建
==============================================================*/
e_item_status get_environ_temp_status(void);

/*=============================================================
* 函数名称：get_power_temp_status
* 函数功能：获取指定功率温度状态
* 参数个数：0
* 参数描述：
* 返 回 值：
*           功率温度状态
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-09-09       	戴辉发     	创建
==============================================================*/
e_item_status get_power_temp_status(void);
/*=============================================================
 * 函数名称：get_cell_temerature
 * 函数功能：获取电芯温度
 * 参数个数：1
 * 参数描述：
 * 
 * 返 回 值：
 *           当前电芯1温度, 单位为0.1℃
 * 修改记录：
 *===============================================================
 * 日    期          修改人      修改类型
 * 2018-07-07        戴辉发     	创建
==============================================================*/
void get_cell_temerature(int32_t r_value, uint8_t no);
/*=============================================================
* 函数名称：get_cell_temp
* 函数功能：获取指定序号的电芯温度
* 参数个数：1
* 参数描述：
*           [IN]    index       电芯温度序号
* 返 回 值：
*           电芯温度
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-06-14       	戴辉发     	创建
==============================================================*/
int16_t get_cell_temp(uint8_t index);

/*=============================================================
* 函数名称：get_min_cell_temp
* 函数功能：获取当前最低电芯温度
* 参数个数：0
* 参数描述：
* 返 回 值：
*          最高电芯温度
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2019-08-22       	戴辉发     	创建
==============================================================*/
int16_t get_min_cell_temp(void);

/*=============================================================
* 函数名称：get_power_temp
* 函数功能：获取功率温度
* 参数个数：0
* 参数描述：
* 返 回 值：
*           功率温度
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-06-14       	戴辉发     	创建
==============================================================*/
int16_t get_power_temp(void);

/*=============================================================
* 函数名称：get_enviror_temp
* 函数功能：获取环境温度
* 参数个数：0
* 参数描述：
* 返 回 值：
*           环境温度
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-06-14       	戴辉发     	创建
==============================================================*/
int16_t get_enviror_temp(void);

/*=============================================================
 * 函数名称：get_max_cell_temp
 * 函数功能：获取当前最高电芯温度
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 *          最高电芯温度
 * 修改记录：
 *==============================================================
 * 日    期          修改人      修改类型
 * 2019-08-22       	戴辉发     	创建
==============================================================*/
int16_t get_max_cell_temp(void);

/*=============================================================
 * 函数名称：get_min_cell_temp
 * 函数功能：获取当前最低电芯温度
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 *          最高电芯温度
 * 修改记录：
 *==============================================================
 * 日    期          修改人      修改类型
 * 2019-08-22       	戴辉发     	创建
==============================================================*/
int16_t get_min_cell_temp(void);
/*=============================================================
 * 函数名称：get_average_cell_temp
 * 函数功能：获取平均电芯温度
 * 参数个数：0
 * 参数描述：
 * 
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期          修改人      修改类型
 * 2018-07-06        戴辉发     	创建
==============================================================*/
int16_t get_average_cell_temp(void);


/*=============================================================
 * 函数名称：switch_judge_power_process
 * 函数功能：功率温度异常温升判决MOS开关正常还是失效
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 * 修改记录：
 *===============================================================
 * 日    期             修改人      修改类型
 * 2020-02-17       	戴辉发     	创建
==============================================================*/
void switch_judge_power_process(void);
/*=============================================================
 * 函数名称：get_max_cell_temp_no
 * 函数功能：获取当前最高电芯温度号
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 *          最高电芯温度号
 * 修改记录：
 *==============================================================
 * 日    期             修改人      修改类型
 * 2020-6-3      	    李勇     	创建
==============================================================*/
uint8_t get_min_cell_temp_no(void);
/*=============================================================
 * 函数名称：get_max_cell_temp_no
 * 函数功能：获取当前最高电芯温度号
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 *          最高电芯温度号
 * 修改记录：
 *==============================================================
 * 日    期             修改人      修改类型
 * 2020-6-3      	    李勇     	创建
==============================================================*/
uint8_t get_max_cell_temp_no(void);
/*=============================================================
 * 函数名称：GetCellTemerature
 * 函数功能：获取电芯温度
 * 参数个数：1
 * 参数描述：
 * 
 * 返 回 值：
 *           当前电芯1温度, 单位为0.1℃
 * 修改记录：
 *===============================================================
 * 日    期          修改人      修改类型
 * 2021-11-17        liyong    	 创建
==============================================================*/
int16_t GetCellTemerature(int32_t r_value);

/*=============================================================
 * 函数名称：get_report_temp
 * 函数功能：获取向上报告的温度
 * 参数个数：1
 * 参数描述：
 * 
 * 返 回 值：
 *           当前电芯1温度, 单位为℃，基准点为100
 * 修改记录：
 *===============================================================
 * 日    期          修改人      修改类型
 * 2018-07-07        戴辉发      创建
 * 2021-11-03        戴辉发      修改上报逻辑，按照严重程度优先原则
==============================================================*/
uint8_t get_report_temp(void);

/*=============================================================
 * 函数名称：temperature_mange
 * 函数功能：温度逻辑处理模块温度处理主流程
 * 参数个数：0
 * 参数描述：
 * 
 * 返 回 值：无
 * 修改记录：
 *=============================================================
 * 日    期          修改人         修改类型
 * 2018-06-14        戴辉发     	创建
 * 2021-11-03        戴辉发         温度处理归一化
==============================================================*/
uint8_t GetTempDifferentFlag(void);
#endif
