/*---------------------------------------------------------*
 * Copyright (C) 2018 杭州优恩捷科技有限公司。版权所有。
 *
 * 文件名：vol_curr_addi_deal.h
 * 文件功能描述：实现电流电压相互之间的辅助判断
 * 
 * 修改记录：
 * 2020-02-27 戴辉发   创建
*----------------------------------------------------------*/

#ifndef _VOL_CURR_ADDI_DEAL_DEFINE_
#define _VOL_CURR_ADDI_DEAL_DEFINE_

#include <stdint.h>

/*=============================================================
 * 函数名称：vol_curr_addi_deal_mem_init
 * 函数功能：电压电流辅助判决
 * 参数个数：0
 * 参数描述：
 * 
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期          修改人      修改类型
 * 2020-02-27        戴辉发     	创建
==============================================================*/
void vol_curr_addi_deal_mem_init(void);

/*=============================================================
 * 函数名称：vol_curr_addi_deal_100mstimer
 * 函数功能：电压电流辅助判决定时器
 * 参数个数：0
 * 参数描述：
 * 
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期          修改人      修改类型
 * 2020-03-07        戴辉发      创建
==============================================================*/
void vol_curr_addi_deal_100mstimer(void);

/*=============================================================
 * 函数名称：vol_curr_addi_wakeup_mem_init
 * 函数功能：辅助判决模块唤醒初始化
 * 参数个数：0
 * 参数描述：
 * 
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期          修改人      修改类型
 * 2020-02-29        戴辉发     	创建
==============================================================*/
void vol_curr_addi_wakeup_mem_init(void);

/*=============================================================
 * 函数名称：set_init_soc
 * 函数功能：设定初始SOC
 * 参数个数：0
 * 参数描述：
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期          修改人      修改类型
 * 2020-02-27        戴辉发     	创建
==============================================================*/
void set_init_soc(void);

/*=============================================================
 * 函数名称：设定电压
 * 函数功能：设定初始总压
 * 参数个数：1
 * 参数描述：
 *          [IN]     total_vol  电芯电压缓冲
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期          修改人      修改类型
 * 2020-02-27        戴辉发     	创建
==============================================================*/
void set_cell_vol(uint32_t total_vol);

/*=============================================================
 * 函数名称：vol_curr_soc_update
 * 函数功能：辅助模块，SOC更新
 * 参数个数：curr
 * 参数描述：
 *          [IN]     ccurr       电流
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期          修改人      修改类型
 * 2020-02-27        戴辉发     	创建
==============================================================*/
void vol_curr_soc_update(int16_t curr);

/*=============================================================
 * 函数名称：get_curr_afe_flag
 * 函数功能：获取电流判决结果
 * 参数个数：0
 * 参数描述：
 *          
 * 返 回 值：
 *          0        无异常
 *          1        电压电流异常
 * 修改记录：
 *==============================================================
 * 日    期          修改人      修改类型
 * 2020-02-27        戴辉发     	创建
==============================================================*/
uint8_t get_curr_afe_flag(void);

/*=============================================================
 * 函数名称：vol_curr_deal_process
 * 函数功能：电压电流互为判决处理流程
 * 参数个数：0
 * 参数描述：
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期          修改人      修改类型
 * 2020-02-27        戴辉发     	创建
==============================================================*/
void vol_curr_deal_process(void);

#endif
