#ifndef _VOLTAGE_MANAGE_DEFINE_
#define _VOLTAGE_MANAGE_DEFINE_

#include "stdint.h"

#define MIN_VOLTAGE_VALUE          2000
#define MAX_VOLTAGE_VALUE          4500

typedef enum E_VOLTAGE_STATUS_TYPE
{
    E_VOL_UNDER, 
    E_VOL_UNDER_ALARM, 
    E_VOL_IDLE, 
    E_VOL_OVER_ALARM, 
    E_VOL_OVER, 
}e_voltage_status;

extern uint16_t g_report_cell_vol[];
extern uint16_t g_report_Voltage; //上报总电压 0.1V/bit
/*=============================================================
* 函数名称：v_timer_s_run
* 函数功能：电压逻辑模块1s定时器
* 参数个数：0
* 参数描述：
* 
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-06-14       	戴辉发     	创建
==============================================================*/
void v_timer_s_run(void);

/*=============================================================
* 函数名称：vol_manage_init
* 函数功能：电压逻辑模块内存初始化
* 参数个数：0
* 参数描述：
* 
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-06-14       	戴辉发     	创建
==============================================================*/
void vol_manage_init(void);

/*=============================================================
* 函数名称：vol_wakeup_init
* 函数功能：电压逻辑模块唤醒内存初始化
* 参数个数：0
* 参数描述：
* 
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2019-08-09       	戴辉发     	创建
==============================================================*/
void vol_wakeup_init(void);

/*=============================================================
 * 函数名称：vol_wakeup_clear_over
 * 函数功能：电压逻辑模块唤醒后清除过压状态
 * 参数个数：0
 * 参数描述：
 * 
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期          修改人      修改类型
 * 2020-02-27        戴辉发     	创建
==============================================================*/
void vol_wakeup_clear_over(void);

/*=============================================================
 * 函数名称：vol_sleep_set_over
 * 函数功能：电池睡眠前主动设置过压保护状态
 * 参数个数：0
 * 参数描述：
 * 
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期          修改人      修改类型
 * 2020-02-27        戴辉发     	创建
==============================================================*/
void vol_sleep_set_over(void);

/*=============================================================
* 函数名称：vol_data_init
* 函数功能：电压管理模块与硬件相关数据初始化
* 参数个数：0
* 函数参数：
* 返 回 值：
*           无
* 修改记录：
*===============================================================
* 日期                修改人             修改内容
* 2018-07-07          戴辉发             创建
==============================================================*/
void vol_data_init(void);

/*=============================================================
* 函数名称：judge_vol_sample_finished
* 函数功能：获取电压采样完整性标志
* 参数个数：0
* 参数描述：
* 
* 返 回 值：
*           电压采样完整标志
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-09-07       	戴辉发     	创建
==============================================================*/
uint8_t judge_vol_sample_finished(void);

/*=============================================================
* 函数名称：clear_vol_firist_finished
* 函数功能：清除电压采样完整性标志
* 参数个数：0
* 参数描述：
* 
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-10-16       	戴辉发     	创建
==============================================================*/
void clear_vol_firist_finished(void);

/*=============================================================
* 函数名称：cell_get_voltage_process
* 函数功能：获取流程
* 参数个数：1
* 参数描述：
*          [IN]     ad_value    AD值
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-06-14       	戴辉发     	创建
==============================================================*/
void cell_get_voltage_process(uint8_t index,float ad_value);
/*=============================================================
* 函数名称：vol_manage_process
* 函数功能：电压管理流程
* 参数个数：0
* 参数描述：
* 
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-06-14       	戴辉发     	创建
==============================================================*/
void vol_manage_process(void);

/*=============================================================
* 函数名称：get_vol_status
* 函数功能：获取电压状态
* 参数个数：0
* 参数描述：
* 
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-06-25       	戴辉发     	创建
==============================================================*/
e_voltage_status get_vol_status(void);

/*=============================================================
* 函数名称：get_cell_vol_status
* 函数功能：获取单体电压状态
* 参数个数：0
* 参数描述：
* 
* 返 回 值：
*           单体电压状态
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-09-09       	戴辉发     	创建
==============================================================*/
e_voltage_status get_cell_vol_status(void);

/*=============================================================
* 函数名称：get_total_vol_status
* 函数功能：获取单体电压状态
* 参数个数：0
* 参数描述：
* 
* 返 回 值：
*           总压状态
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-09-09       	戴辉发     	创建
==============================================================*/
e_voltage_status get_total_vol_status(void);

/*=============================================================
* 函数名称：get_max_cell_vol
* 函数功能：获取最高电压
* 参数个数：0
* 参数描述：
* 
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-07-06       	戴辉发     	创建
==============================================================*/
uint16_t get_max_cell_vol(void);
/*=============================================================
 * 函数名称：uint16_t GetTotalVoltage(void)
 * 函数功能：计算总电流
 * 参数个数：1
 * 参数描述：
 *          [IN]     ad_value    AD值
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期          修改人      修改类型
 * 2020-03-31         李勇     	创建
==============================================================*/
uint16_t GetTotalVoltage(void);

/*=============================================================
* 函数名称：get_min_cell_vol
* 函数功能：获取最低电压
* 参数个数：0
* 参数描述：
* 
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-07-06       	戴辉发     	创建
==============================================================*/
uint16_t get_min_cell_vol(void);

/*=============================================================
* 函数名称：get_average_vol
* 函数功能：获取平均电压
* 参数个数：0
* 参数描述：
* 
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-07-06       	戴辉发     	创建
==============================================================*/
uint16_t get_average_vol(void);

/*=============================================================
* 函数名称：find_max_cell
* 函数功能：找到高电压位置
* 参数个数：1
* 参数描述：
*           [IN/OUT] max         返回位置缓冲
* 返 回 值：无
* 修改记录：
*===============================================================
* 日    期           修改人      修改类型
* 2018-07-06       	 戴辉发      创建
==============================================================*/
void find_max_cell(uint8_t *max);

/*=============================================================
* 函数名称：get_max_cell_index
* 函数功能：找到高电压位置
* 参数个数：0
* 参数描述：
* 返 回 值：
*          最高电压下标
* 修改记录：
*===============================================================
* 日    期           修改人      修改类型
* 2019-08-17       	 戴辉发      创建
==============================================================*/
uint8_t get_max_cell_index(void);

/*=============================================================
* 函数名称：get_min_cell_index
* 函数功能：找到最低电压电芯位置
* 参数个数：0
* 参数描述：
* 返 回 值：
*          最低电压下标
* 修改记录：
*===============================================================
* 日    期           修改人      修改类型
* 2019-08-17       	 戴辉发      创建
==============================================================*/
uint8_t get_min_cell_index(void);

/*=============================================================
* 函数名称：get_total_vol
* 函数功能：获取总压
* 参数个数：0
* 参数描述：
* 返 回 值：
*           总压，单位10毫伏
* 修改记录：
*===============================================================
* 日    期           修改人      修改类型
* 2018-07-07       	 戴辉发      创建
==============================================================*/
uint32_t get_total_vol(void);

/*=============================================================
* 函数名称：get_cell_vol
* 函数功能：获取指定位置电芯电压
* 参数个数：1
* 参数描述：
*           [IN]     index       电芯位置
* 返 回 值：
*           总压，单位10毫伏
* 修改记录：
*===============================================================
* 日    期           修改人      修改类型
* 2018-07-07       	 戴辉发      创建
==============================================================*/
uint16_t get_cell_vol(uint8_t index);

/*=============================================================
* 函数名称：get_real_cell_vol
* 函数功能：获取指定索引电芯电压
* 参数个数：1
* 参数描述：
*           [IN]     index       电芯位置
* 返 回 值：
*           总压，单位10毫伏
* 修改记录：
*===============================================================
* 日    期           修改人      修改类型
* 2018-07-07       	 戴辉发      创建
==============================================================*/
uint16_t get_real_cell_vol(uint8_t index);

/*=============================================================
* 函数名称：judge_low_voltage
* 函数功能：判断欠压保护状态
* 参数个数：0
* 参数描述：
* 返 回 值：
*           0        电压正常
*           1        欠压保护状态
* 修改记录：
*===============================================================
* 日    期           修改人      修改类型
* 2018-07-07       	 戴辉发      创建
==============================================================*/
uint16_t judge_low_voltage(void);

/*=============================================================
 * 函数名称：get_vol_afe_status
 * 函数功能：获取判决依据为电压的AFE状态
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 *          0         AFE正常
 *          1         AFE异常
 * 修改记录：
 *==============================================================
 * 日    期           修改人      修改类型
 * 2020-02-01         戴辉发      创建
==============================================================*/
uint8_t get_vol_afe_status(void);

/*=============================================================
 * 函数名称：vol_afe_fault_process
 * 函数功能：判断欠压保护状态
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 *          0         电压正常
 *          1         欠压保护状态
 * 修改记录：
 *==============================================================
 * 日    期           修改人      修改类型
 * 2020-02-21         戴辉发      创建
==============================================================*/
void vol_afe_fault_process(void);
/*=============================================================
 * 函数名称：get_vol_two_comp
 * 函数功能：获取AFE和MCU检查的总压比较结果
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 *          0         正常
 *          1         异常
 * 修改记录：
 *==============================================================
 * 日    期           修改人      修改类型
 * 2020-06-01         liy      创建
==============================================================*/
uint8_t get_vol_two_comp(void);
/*=============================================================
 * 函数名称：set_max_cell_over_voltage
 * 函数功能：设置 最高电压电芯 为过压状态
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 *          
 * 修改记录：
 *==============================================================
 * 日    期           修改人      修改类型
 * 2021-05-10          liyong      创建
==============================================================*/
void set_max_cell_over_voltage(void);
/*=============================================================
 * 函数名称：VoltageProtectTimerDelay
 * 函数功能：电压保护处理100ms延时
 * 参数个数：0
 * 参数描述：
 * 
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期          修改人      修改类型
 * 2022-05-09        李勇     	创建
==============================================================*/
void VoltageProtectTimerDelay(void);
/*=============================================================
 * 函数名称：GetReportVol
 * 函数功能：获取当前问题最严重的电压
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 *==============================================================
 * 日    期           修改人      修改类型
 * 2024-07-15         Fanyl      创建
==============================================================*/
uint16_t GetReportVol(void);
#endif

