/**************************/
/*---------------------------------------------------------*
* Copyright (C) 2018 杭州优恩捷科技有限公司。版权所有。
*
* 文件名：adc_sampling.c
* 文件功能描述：实现AD采集
*
* 修改记录：
* 2018-06-25 戴辉发 创建
*----------------------------------------------------------*/

#ifndef _ADC_SAMPLING_DEFINE_
#define _ADC_SAMPLING_DEFINE_
#include "fm33lg0xx_fl_adc.h"

typedef enum E_AD_CH_ENUM
{
	CH_AMBIENT_TEMP_ADS = FL_ADC_EXTERNAL_CH3,
	CH_POWER_TEMP_ADS   = FL_ADC_EXTERNAL_CH11,
    CH_V3V3_ADS         = FL_ADC_EXTERNAL_CH9,
    /*CELL_TEMP1_ADS      = FL_ADC_EXTERNAL_CH1,
    HALL_CURRENT_ADS    = FL_ADC_EXTERNAL_CH0,  
    TOTAL_VOLTAGE_ADS   = FL_ADC_EXTERNAL_CH16,*/
	CH_VREF_INT         = FL_ADC_INTERNAL_VREF1P2, 
}e_ad_ch_type;

void adc_init(void);
int32_t adc_get_sampling_value(e_ad_ch_type adc_chanel);

/*==============================================================
* 函数名称：adc_mem_init
* 函数功能：ADC MEM管脚初始化
* 参数个数：0
* 函数参数：
* 返 回 值：
*           无
* 修改记录：
*===============================================================
* 日期                修改人             修改内容
* 2019-05-14         戴辉发             创建
==============================================================*/
void adc_mem_init(void);

/*==============================================================
* 函数名称：adc_sample_timer
* 函数功能：ADC定时器流程
* 参数个数：0
* 函数参数：
* 返 回 值：
*           无
* 修改记录：
*===============================================================
* 日期                修改人             修改内容
* 2019-05-14         戴辉发             创建
==============================================================*/
void adc_sample_timer(void);

/*=============================================================
 * 函数名称：get_voltage_process
 * 函数功能：获取流程
 * 参数个数：1
 * 参数描述：
 *          [IN]     ad_value    AD值
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期          修改人      修改类型
 * 2020-05-05        戴辉发     	创建
==============================================================*/
uint16_t get_voltage_process(int32_t ad_value);

/*=============================================================
* 函数名称：adc_data_get_process
* 函数功能：电流获取过程
* 参数个数：0
* 函数参数：
* 返 回 值：
* 修改记录：
*===============================================================
* 日期                修改人             修改内容
* 2019-05-14          戴辉发             创建
==============================================================*/
void adc_data_get_process(void);

/*=============================================================
 * 函数名称：setvcc3v3_vaule()
 * 函数功能：设置VCC3V3的值
 * 参数个数：1
 * 参数描述：
 *          [IN]     value    
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期          修改人      修改类型
 * 2021-07-12         李勇     	创建
==============================================================*/
void setvcc3v3_vaule(uint16_t vaule);

/*=============================================================
 * 函数名称：uint16_t get_vcc3v3_vaule( void )
 * 函数功能：获取VCC3V3的值
 * 参数个数：1
 * 参数描述：
 *          [IN]     value    
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期          修改人      修改类型
 * 2021-07-12         李勇     	创建
==============================================================*/
uint16_t get_vcc3v3_vaule( void );
/*=============================================================
 * 函数名称：uint16_t GetPackVoltage(void)
 * 函数功能：获取pack电压
 * 参数个数：1
 * 参数描述：
 *          [IN]     ad_value    AD值
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期          修改人      修改类型
 * 2020-03-31         李勇     	创建
==============================================================*/
uint16_t GetPackVoltage(void);
/*=============================================================
 * 函数名称：SetCollectPackVoltageFlag
 * 函数功能：开启或者停止pack电压采集
 * 参数个数：1
 * 参数描述：
 *          [IN]     value    
 * 返 回 值：无
 * 修改记录：
 *==============================================================
 * 日    期          修改人      修改类型
 * 2021-11-22         李勇     	创建
==============================================================*/
void SetCollectPackVoltageFlag(uint8_t flag);
#endif

