/*---------------------------------------------------------*
* Copyright (C) 2017 艾启新能源有限公司。版权所有。
*
* 文件名：can.c
* 文件功能描述：实现CAN硬件底层驱动，根据示例代码修改
*
* 修改记录：
* 2017-10-06 戴辉发 创建
*----------------------------------------------------------*/

#ifndef __CAN_H__
#define __CAN_H__

#include "applicfg.h"
#include<stdint.h>

#define MAX_CAN_USED_NUM        (1)
#define CAN_PORT_01             (1)
#define CAN_PORT_02             (2)


typedef enum _E_CAN_BAUDRATE_TYPE_
{
	E_CAN_BAUDRATE_100K =0, 
	E_CAN_BAUDRATE_125K =1, 
	E_CAN_BAUDRATE_250K =2, 
	E_CAN_BAUDRATE_500K =3, 
    E_CAN_BAUDRATE_800K =4, 
	E_CAN_BAUDRATE_1M  = 5, 
	E_CAN_BAUDRATE_MAX_NUM
}e_can_baudrate;

typedef struct
{
    uint32_t StdId :11 ;  /* ID[28:18]  标准帧 id */
    uint32_t SRR   :1  ;  /*仅标准帧有效，扩展帧应保持1 1：表示当前消息帧是一个remote frame  0：表示当前消息帧是一个data frame */
    uint32_t IDE   :1  ;  /*1：使用扩展消息识别码，29位ID  0：使用标准消息识别码，11位ID */
    uint32_t extId :18 ;  /*ID[18:0]  */
    uint32_t RTR   :1  ;  /*仅扩展帧有效 1：remote frame  0：data frame*/
} CanID_bits;

typedef union
{
    uint32_t canId;  
    CanID_bits canid_bits;   
}CanID;

    
typedef struct
{
    CanID  txcanId;  
    uint8_t DLC;     /*!< Specifies the length of the frame that will be
                        transmitted. This parameter can be a value between
                        0 to 8 */
    uint8_t Data[8]; /*!< Contains the data to be transmitted. It ranges from 0
                        to 0xFF. */
} CanTxMsg;


typedef struct
{
    CanID rxcanId;  
    uint8_t DLC;     /*!< Specifies the length of the frame that will be received.
                        This parameter can be a value between 0 to 8 */

    uint8_t Data[8]; /*!< Contains the data to be received. It ranges from 0 to
                        0xFF. */
} CanRxMsg;
/*=============================================================
* 函数名称：can_mem_init
* 函数功能：can模块底层内存初始化
* 参数个数：0
* 函数参数：
* 返 回 值：
*           无
* 修改记录:
*===============================================================
* 日期             修改人     修改内容
* 2017-11-13       戴辉发     创建
==============================================================*/
void can_mem_init(void);

/*=============================================================
* 函数名称：clear_can_send_buff
* 函数功能：清除发送缓冲
* 参数个数：0
* 函数参数：
*           [IN]   tx_msg     本次发送数据
* 返 回 值：
*           写入数据长度
* 修改记录:
*===============================================================
* 日期                       修改人     修改内容
* 2018-07-09       戴辉发     创建
==============================================================*/
void clear_can_send_buff(void);

/*=============================================================
* 函数名称：get_data_from_can_recv_buff
* 函数功能：从接收缓冲中读取一包数据
* 参数个数：1
* 函数参数：
*           [IN/OUT]   Rx_msg     数据缓冲
* 返 回 值：
*           0                     表示没有取到数据
*           sizeof(CanRxMsg)      获取到一包数据
* 修改记录:
*===============================================================
* 日期                 修改人     修改内容
* 2018-07-09           戴辉发     创建
==============================================================*/
uint8_t get_data_from_can_recv_buff(CanRxMsg *rx_msg);

/**
  * @file   CAN_Configuration
  * @brief  Configures the CAN* @param  无
  * @retval 无
  */
void CAN_Configuration(e_can_baudrate baudrate);

/*=============================================================
* 函数名称：set_can_std_filter
* 函数功能：CAN滤波器标准标识符屏蔽模式设置
* 参数个数：2
* 函数参数：
*           [IN]   id_buff    标识符列表
*           [IN]   id_num     标识符列表中标识符个数
* 返 回 值：
*           无
* 修改记录:
*===============================================================
* 日期             修改人     修改内容
* 2017-11-15       戴辉发     创建
==============================================================*/
void set_can_std_filter(const uint16_t *id_buff, unsigned int id_num);

/*=============================================================
* 函数名称：set_can_ext_filter
* 函数功能：CAN滤波器扩展标识符屏蔽模式设置
* 参数个数：2
* 函数参数：
*           [IN]   id_buff    标识符列表
*           [IN]   id_num     标识符列表中标识符个数
* 返 回 值：
*           无
* 修改记录:
*===============================================================
* 日期             修改人     修改内容
* 2017-11-15       戴辉发     创建
==============================================================*/
void set_can_ext_filter(const uint32_t *id_buff, uint32_t id_num);

/*=============================================================
* 函数名称：can_std_transmit
* 函数功能：CAN发送带扩展标识数据
* 参数个数：4
* 函数参数：
*           [IN]   id         标识符     
*           [IN]   data_buf   发送数据缓冲     
*           [IN]   rtr        RTR标志
*           [IN]   len        数据长度，字节为单位     
* 返 回 值：
*           发送有效数据长度
* 修改记录:
*===============================================================
* 日期             修改人     修改内容
* 2017-10-06       戴辉发     创建
==============================================================*/
uint8_t can_std_transmit(unsigned int id, uint8_t *data_buf, uint8_t rtr, uint8_t len);

/*=============================================================
* 函数名称：can_ext_transmit
* 函数功能：CAN发送带扩展标识数据
* 参数个数：3
* 函数参数：
*           [IN]   id         标识符     
*           [IN]   data_buf   发送数据缓冲     
*           [IN]   len        数据长度，字节为单位     
* 返 回 值：
*           发送有效数据长度
* 修改记录:
*===============================================================
* 日期             修改人     修改内容
* 2017-10-06       戴辉发     创建
==============================================================*/
uint8_t can_ext_transmit(unsigned int id, uint8_t *data_buf, uint8_t len);

/*=============================================================
* 函数名称：CEC_CAN_IRQHandler
* 函数功能：CAN中断服务函数
* 参数个数：0
* 函数参数：
* 返 回 值：
*           无
* 修改记录:
*===============================================================
* 日期             修改人     修改内容
* 2017-10-06       戴辉发     创建
==============================================================*/
void CEC_CAN_IRQHandler(void);

/*=============================================================
* 函数名称：CAN_RX_Process
* 函数功能：CAN接收数据流程
* 参数个数：0
* 函数参数：
* 返 回 值：
*           无
* 修改记录:
*===============================================================
* 日期             修改人     修改内容
* 2017-11-13       戴辉发     创建
==============================================================*/
void CAN_RX_Process(void);

/*=============================================================
* 函数名称：CAN_TX_Process
* 函数功能：CAN发送数据流程
* 参数个数：0
* 函数参数：
* 返 回 值：
*           无
* 修改记录:
*===============================================================
* 日期             修改人     修改内容
* 2017-11-13       戴辉发     创建
==============================================================*/
void CAN_TX_Process(void);
/*=============================================================
* 函数名称：Can_tx_time
* 函数功能：CAN发送数据延时
* 参数个数：0
* 函数参数：
* 返 回 值：
*           无
* 修改记录:
*===============================================================
* 日期             修改人     修改内容
* 2020-11-12       liyong     创建
==============================================================*/
void Can_tx_time(void);
#endif
/*********************************************************************************************************
**                                        End Of File
*********************************************************************************************************/

