/*---------------------------------------------------------*
 * Copyright (C) 2018 杭州优恩捷科技有限公司。版权所有。
 *
 * 文件名：ch_detect.h
 * 文件功能描述：实现充电器检测
 * 
 * 修改记录：
 * 2020-07-08    戴辉发        创建
 *---------------------------------------------------------*/
#ifndef _CH_DETECT_DEFINE_
#define _CH_DETECT_DEFINE_

#include <stdint.h>

#define CH_INIT_VALUE          0
#define CH_NOEXIST_VALUE       1
#define CH_EXIST_VALUE         2

/*==============================================================
 * 函数名称：ch_detect_mem_init
 * 函数功能：充电器检测模块内存初始化
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *           无
 * 修改记录:
 *===============================================================
 * 日期                修改人             修改内容
 * 2020-07-08          戴辉发             创建
==============================================================*/
void ch_detect_mem_init(void);

/*==============================================================
 * 函数名称：ch_detect_hard_init
 * 函数功能：充电器检测模块硬件初始化
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *           无
 * 修改记录:
 *===============================================================
 * 日期                修改人             修改内容
 * 2020-07-08          戴辉发             创建
==============================================================*/
void ch_detect_hard_init(void);

/*=============================================================
 * 函数名称：get_ch_detect_gpio_status
 * 函数功能：获取盲充电源检测管脚状态
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 *           0       低电平
 *           1       高电平
 * 修改记录：
 *===============================================================
 * 日    期          修改人      修改类型
 * 2020-07-23        戴辉发      创建
==============================================================*/
uint8_t get_ch_detect_gpio_status(void);

/*=============================================================
 * 函数名称：set_ch_detect_flag
 * 函数功能：设置盲充电压检测状态
 * 参数个数：1
 * 参数描述：
 *          [IN]     flag        标志
 * 返 回 值：
 *           无
 * 修改记录：
 *===============================================================
 * 日    期          修改人      修改类型
 * 2020-07-23        戴辉发      创建
==============================================================*/
void set_ch_detect_flag(uint8_t flag);

/*=============================================================
 * 函数名称：get_ch_detect_flag
 * 函数功能：获取盲充电压检测状态
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 *          返回当前盲充接入状态
 * 修改记录：
 *===============================================================
 * 日    期          修改人      修改类型
 * 2020-07-23        戴辉发      创建
==============================================================*/
uint8_t get_ch_detect_flag(void);

/*==============================================================
 * 函数名称：ch_detect_10ms_timer
 * 函数功能：充电器检测模块10毫秒定时器
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *           无
 * 修改记录:
 *===============================================================
 * 日期                修改人             修改内容
 * 2020-07-08          戴辉发             创建
==============================================================*/
void ch_detect_10ms_timer(void);

/*==============================================================
 * 函数名称：get_ch_exist_status
 * 函数功能：判决充电器存在状态
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *          CH_INIT_VALUE          初始状态
 *          CH_NOEXIST_VALUE       充电器断开
 *          CH_EXIST_VALUE         充电器接入
 * 修改记录:
 *==============================================================
 * 日期                修改人             修改内容
 * 2020-07-08          戴辉发             创建
==============================================================*/
uint8_t get_ch_exist_status(void);

/*==============================================================
 * 函数名称：set_ch_exist_status
 * 函数功能：设定充电器存在状态
 * 参数个数：1
 *           [IN]      flag               充电器状态
 * 函数参数：
 * 返 回 值：
 *           无
 * 修改记录:
 *===============================================================
 * 日期                修改人             修改内容
 * 2020-07-08          戴辉发             创建
==============================================================*/
void set_ch_exist_status(uint8_t flag);

/*=============================================================
 * 函数名称：ch_detect_process
 * 函数功能：充电器检测流程
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 * 修改记录：
 *==============================================================
 * 日期                修改人             修改内容
 * 2020-07-08          戴辉发             创建
==============================================================*/
void ch_detect_process(void);
/*=============================================================
 * 函数名称：getChConnectGpioStatus
 * 函数功能：设置充电器检测的管脚状态
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 *           0       检测管脚为低电平
 *           1       检测管脚为高电平
 * 修改记录：
 *===============================================================
 * 日    期          修改人      修改类型
 * 2022-05-07        戴辉发      创建
 ==============================================================*/
uint8_t getChConnectGpioStatus(void);
/*==============================================================
 * 函数名称：get_ch_exist_status
 * 函数功能：判决充电机是否接入
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *         1：接入
           0：未接入
 * 修改记录:
 *==============================================================
 * 日期                修改人             修改内容
 * 2020-11-04          liyong             创建
==============================================================*/
uint8_t get_charger_connect_status(void);
/*==============================================================
 * 函数名称：ch_detect_wakeup_mem_init
 * 函数功能：充电器检测模块唤醒内存初始化
 * 参数个数：0
 * 函数参数：
 * 返 回 值：
 *           无
 * 修改记录：
 *===============================================================
 * 日期                修改人             修改内容
 * 2023-02-24          李勇               创建
==============================================================*/
void ch_detect_wakeup_mem_init(void);
/*==============================================================
 * 函数名称：ChargerType1Process
 * 函数功能：类型1充电机处理流程（带电压检测型充电机，且带key接入）
 * 函数参数：无
 * 返 回 值：无
 * 修改记录:
 *==============================================================
 * 日期                修改人             修改内容
 * 2023-02-24          李勇               创建
==============================================================*/
void ChargerType1Process(void);
/*==============================================================
 * 函数名称：ChargerIsConnect
 * 函数功能：充电机连接了吗
 * 函数参数：无
 * 返 回 值：
             0：充电机已经连接
             1：充电机未连接
 * 修改记录:
 *==============================================================
 * 日期                修改人             修改内容
 * 2023-02-24          李勇               创建
==============================================================*/
uint8_t ChargerIsConnect(void);
#endif
