/*---------------------------------------------------------*
* Copyright (C) 2018 杭州优恩捷科技有限公司。版权所有。
*
* 文件名：idog.c
* 文件功能描述：实现watchdog操作
* 
* 修改记录：
* 2018-07-05 戴辉发 创建
*----------------------------------------------------------*/
#include "idog.h"
#include "fm33lg0xx_fl.h"
uint8_t rcu_reset_flag;
/*=============================================================
* 函数名称：iwdg_init
* 函数功能：WDOG硬件初始化
* 参数个数：0
* 参数描述：
* 返 回 值：
*           无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-07-05       	戴辉发     	创建
==============================================================*/
void iwdg_init(void)
{
    //当芯片处于调试模式时，软件可以通过配置 MCUDBGCR 寄存器在调试过程中暂停 IWDT
    FL_IWDT_InitTypeDef IWDT_InitStruct;
    /* 默认不使用窗口 */
    IWDT_InitStruct.iwdtWindows    = 0;
    /*最长溢出时间*/
    IWDT_InitStruct.overflowPeriod = FL_IWDT_PERIOD_2000MS;
    FL_IWDT_Init(IWDT, &IWDT_InitStruct);
}

/*=============================================================
* 函数名称：feed_iwdg
* 函数功能：喂狗操作
* 参数个数：0
* 参数描述：
* 返 回 值：
*           无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-07-05       	戴辉发     	创建
==============================================================*/
void feed_iwdg(void)
{
	 FL_IWDT_ReloadCounter(IWDT);
}

/*=============================================================
* 函数名称：feed_hard_owdg
* 函数功能：喂外部狗操作
* 参数个数：0
* 参数描述：
* 返 回 值：
*           无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-11-10       	戴辉发     	创建
==============================================================*/
void feed_hard_owdg(void)
{
    FL_GPIO_ToggleOutputPin( GPIOA, FL_GPIO_PIN_13);
}
