/*---------------------------------------------------------*
* Copyright (C) 2018 杭州优恩捷科技有限公司。版权所有。
*
* 文件名：key_status.c
* 文件功能描述：实现钥匙开关状态检测
* 
* 修改记录：
* 2018-07-05 戴辉发 创建
*----------------------------------------------------------*/
#ifndef _KEY_STATUS_DEFINE_
#define _KEY_STATUS_DEFINE_

#include "stdint.h"

/* 开关机键状态 */
typedef enum _E_KEY_STATUS_
{
    E_KEY_INIT_STATUS, /* 初始化状态 */
    E_KEY_OPENED_STATUS, /* 开关机键断开状态 */
    E_KEY_CLOSED_STATUS /* 开关机键闭合状态 */
}e_key_status;





/*=============================================================
* 函数名称：key_timer_ms_run
* 函数功能：钥匙连接状态定时器
* 参数个数：0
* 函数参数：
* 返 回 值：
*           无
* 修改记录：
*===============================================================
* 日期                修改人             修改内容
* 2018-06-27          戴辉发             创建
==============================================================*/
void key_timer_ms_run(void);

/*=============================================================
* 函数名称：get_key_status
* 函数功能：获取钥匙连接状态
* 参数个数：0
* 参数描述：
* 返 回 值：
*          开关机键状态
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-07-05       	戴辉发     	创建
==============================================================*/
e_key_status get_key_status(void);

/*=============================================================
* 函数名称：set_key_off_status
* 函数功能：设定开关机键断开状态
* 参数个数：0
* 参数描述：
* 返 回 值：
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-10-20       	戴辉发     	创建
==============================================================*/
void set_key_off_status(void);

/*=============================================================
* 函数名称：set_key_on_status
* 函数功能：设定开关机键闭合状态
* 参数个数：0
* 参数描述：
* 返 回 值：
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-10-20       	戴辉发     	创建
==============================================================*/
void set_key_on_status(void);

/*=============================================================
* 函数名称：get_key_gpio_status
* 函数功能：获取开关机键管脚状态
* 参数个数：0
* 参数描述：
* 返 回 值：
*           0       低电平
*           1       高电平
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2019-08-08       	戴辉发     	创建
==============================================================*/
uint8_t get_key_gpio_status(void);

/*=============================================================
* 函数名称：key_detect_process
* 函数功能：钥匙连接状态检测流程
* 参数个数：0
* 参数描述：
* 返 回 值：
*           无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-07-12       	戴辉发     	创建
==============================================================*/
void key_detect_process(void);

/*=============================================================
* 函数名称：clear_key_status
* 函数功能：清除钥匙开关机状态
* 参数个数：0
* 参数描述：
* 返 回 值：
*           无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-07-12       	戴辉发     	创建
==============================================================*/
void clear_key_status(void);

/*=============================================================
 *  函数名称：EXTI2_3_IRQHandler
 * 函数功能：钥匙开关检测脚中断
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 *           0       未检测接入信号
 *           1       检测到接入信号
 * 修改记录：
 *===============================================================
 * 日    期          修改人      修改类型
 * 2018-07-12        戴辉发     	创建
==============================================================*/
void EXTI2_3_IRQHandler(void);

#endif

