/*---------------------------------------------------------*
* Copyright (C) 2018 杭州优恩捷科技有限公司。版权所有。
*
* 文件名：power.c
* 文件功能描述：实现控制板电源管理
*
* 修改记录：
* 2018-06-27 戴辉发 创建
*----------------------------------------------------------*/

#ifndef _POWER_DEFINE_
#define _POWER_DEFINE_

#include "stdint.h"

/*=============================================================
* 函数名称：power_hard_init
* 函数功能：电源硬件初始化
* 参数个数：0
* 参数描述：
* 返 回 值：
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-07-09       	戴辉发     	创建
==============================================================*/
void power_hard_init(void);

/*=============================================================
* 函数名称：main_power_on
* 函数功能：电源上电
* 参数个数：0
* 参数描述：
* 返 回 值：
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-07-09       	戴辉发     	创建
==============================================================*/
void main_power_on(void);

/*=============================================================
* 函数名称：main_power_off
* 函数功能：电源掉电
* 参数个数：0
* 参数描述：
* 返 回 值：
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-07-09       	戴辉发     	创建
==============================================================*/
void main_power_off(void);

/*=============================================================
* 函数名称：main_power_detect_process
* 函数功能：主电源模块检测流程
* 参数个数：0
* 参数描述：
* 返 回 值：
*           无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-07-12       	戴辉发     	创建
==============================================================*/
void main_power_detect_process(void);

/*=============================================================
 * 函数名称：get_main_power_detect_status
 * 函数功能：获取主电源有效状态
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 *           0       主电源失效过程
 *           1       主电源正常过程
 * 修改记录：
 *==============================================================
 * 日    期          修改人      修改类型
 * 2020-06-1       	李勇     	创建
==============================================================*/
 uint8_t get_main_power_detect_status(void);
/*=============================================================
* 函数名称：power_timer_ms_run
* 函数功能：功率模块定时器
* 参数个数：0
* 函数参数：
* 返 回 值：
*           无
* 修改记录：
*===============================================================
* 日期                修改人             修改内容
* 2018-06-27          戴辉发             创建
==============================================================*/
void power_timer_ms_run(void);

/*=============================================================
* 函数名称：main_power_off
* 函数功能：电源掉电
* 参数个数：0
* 参数描述：
* 返 回 值：
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-07-09       	戴辉发     	创建
==============================================================*/
void low_power_stop_mode_config(void);

/*=============================================================
* 函数名称：mode_into_low_power_mode
* 函数功能：进入低功耗模式
* 参数个数：1
* 函数参数：
*           [IN]      timer_count        延时毫秒数进入休眠
* 返 回 值：
*           无
* 修改记录：
*===============================================================
* 日期                修改人             修改内容
* 2018-06-27          戴辉发             创建
==============================================================*/
void mode_into_low_power_mode(uint16_t timer_count);
/*=============================================================
 * 函数名称：bms_enter_sheep
 * 函数功能：mcu进入休眠前配置
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 * 修改记录：
 *===============================================================
 * 日    期          修改人      修改类型
 * 2020-09-08         李勇     	创建
==============================================================*/
void bms_enter_sheep(void);
/*=============================================================
* 函数名称：set_key_check_wake_flag
* 函数功能：设定钥匙连接口唤醒标志
* 参数个数：0
* 参数描述：
* 返 回 值：
*           钥匙连接口唤醒标志
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-07-12       	戴辉发     	创建
==============================================================*/
void set_key_check_wake_flag(uint8_t wake_flag);
/*=============================================================
* 函数名称：set_charge_wake_up_flag
* 函数功能：设定充电器连接唤醒标志
* 参数个数：1
* 参数描述：
*           [IN]    wake_flag   唤醒标志
* 返 回 值：
*           无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-07-12       	戴辉发     	创建
==============================================================*/
void set_charge_wake_up_flag(uint8_t wake_flag);
uint8_t awake_detect_proc();
/*=============================================================
* 函数名称：key_mem_init
* 函数功能：钥匙连接状态检测模块内存初始化
* 参数个数：0
* 参数描述：
* 返 回 值：
*           无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-07-12       	戴辉发     	创建
==============================================================*/
void key_mem_init(void);

/*=============================================================
* 函数名称：get_key_check_wake_flag
* 函数功能：获取钥匙连接口唤醒标志
* 参数个数：0
* 参数描述：
* 返 回 值：
*           钥匙连接口唤醒标志
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-07-12       	戴辉发     	创建
==============================================================*/
uint8_t get_key_check_wake_flag(void);
#endif

