#ifndef __RTC_H__
#define __RTC_H__

#include "stdint.h"

#define DATATIME_LENGTH   15

extern uint8_t g_datetime[DATATIME_LENGTH];

/*******************************************************************************
**Input   : No
**Output  : No
**Explain : 
**FuncName:rtc_datetime_init
**Create  : weihl @xxxx-xx-xx
**Modify  : 
*******************************************************************************/
void rtc_datetime_init(void);

/*******************************************************************************
**Input   : No
**Output  : No
**Explain : 
**FuncName: rtc_set_datetime
**Create  : weihl @xxxx-xx-xx
**Modify  : 
*******************************************************************************/
void rtc_set_datetime(void);

void rtc_wake_up_config(void);

void rtc_wake_up_reload_config(void);

/*=============================================================
* 函数名称：rtc_wake_up_close_config
* 函数功能：RTC唤醒中断
* 参数个数：0
* 参数描述：
* 返 回 值：
*           无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-07-12       	戴辉发     	创建
==============================================================*/
void rtc_wake_up_close_config(void);

void rtc_wake_up_time_config(uint32_t n100MS);

/*=============================================================
* 函数名称：RTC_IRQHandler
* 函数功能：RTC唤醒中断
* 参数个数：0
* 参数描述：
* 返 回 值：
*           无
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2018-07-12       	戴辉发     	创建
==============================================================*/
void RTC_IRQHandler(void);
/*=============================================================
* 函数名称：get_rtc_time
* 函数功能：获取rtc时间
* 参数个数：0
* 参数描述：
* 返 回 值：
*           
* 修改记录：
*===============================================================
* 日    期          修改人      修改类型
* 2020-06-14       	李勇    	创建
==============================================================*/
void get_rtc_time(void);
#endif
