/*---------------------------------------------------------*
 * Copyright (C) 2021 杭州优恩捷科技有限公司。版权所有。
 *
 * 文件名：spi.h
 * 文件功能描述：实现底层SPI通信控制操作
 *
 * 修改记录：
 * 2021-06-01 戴辉发 创建
*----------------------------------------------------------*/

#ifndef _NEGT_SPI_DEFINE_
#define _NEGT_SPI_DEFINE_

#include <stdint.h>
#include "fm33lg0xx_fl_spi.h"

/*=============================================================
 * 函数名称：spi_init
 * 函数功能：SPI硬件初始化
 * 参数个数：0
 * 参数描述：
 * 返 回 值：
 *           无
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-06-01        戴辉发      创建
==============================================================*/
void spi_init(SPI_Type *spi);

/*=============================================================
 * 函数名称：spi_deinit
 * 函数功能：SPI硬件休眠
 * 参数个数：1
 * 参数描述：
 *           [IN]     spi        指定SPI
 * 返 回 值：
 *           无
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-06-01        戴辉发      创建
==============================================================*/
void spi_deinit(SPI_Type *spi);

/*=============================================================
 * 函数名称：spi_write_read
 * 函数功能：SPI发送指定字节数据
 * 参数个数：3
 * 参数描述：
 *          [IN]      spi        操作的SPI接口
 *          [IN]      data_buf   本次发送的数据缓冲
 *          [IN]      len        本次发送数据长度
 * 返 回 值：
 *          返回本次发送成功数据个数，以字节为单位
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-06-01        戴辉发      创建
==============================================================*/
uint8_t spi_write(SPI_Type *spi, uint8_t *data_buf, uint8_t len);

/*=============================================================
 * 函数名称：spi_write_read
 * 函数功能：SPI发送指定字节数据
 * 参数个数：4
 * 参数描述：
 *          [IN]      spi        操作的SPI接口
 *          [IN]      cmd        读取标识
 *          [IN/OUT]  data_buf   接收数据缓冲
 *          [IN]      len        需要接收数据长度
 * 返 回 值：
 *          返回本次成功读取到的数据个数，以字节为单位
 * 修改记录：
 *=============================================================
 * 日    期          修改人      修改类型
 * 2021-06-01        戴辉发      创建
==============================================================*/
uint8_t spi_read(SPI_Type *spi, uint8_t cmd, uint8_t *data_buf, uint8_t len);

#endif

